script/mci_cpp_script.org
#+TITLE: C++ By Example
#+SUBTITLE: Skriptum für Programmieren 3 / C++ / MCI / SS2018
#+AUTHOR: Sebastian Stabinger
#+EMAIL: sebastian@stabinger.name
#+OPTIONS: toc:2 email:t
#+PROPERTY: header-args :includes <iostream> :results value raw replace :export code :flags -std=c++11

* Einführung
Dieses Skriptum soll es Ihnen erleichtern dem Stoff der
Lehrveranstaltung /Programmieren 3/ zu folgen. Es ist umfangreicher
als die Folien und enthält zudem mehr Beispiele als in der
Lehrveranstaltung selbst besprochen werden können. Zudem enthält das
Skriptum auch Teile die Ihnen bereits aus Ihren Lehrveranstaltungen zu
C bekannt sein sollten und für die in /Programmieren 3/ keine Zeit zur
Wiederholung ist.

Ich bin der Auffassung, dass gerade Programmieranfänger von einer
großen Anzahl an präsentierten Beispielen profitieren. Ich versuche
daher zu jedem theoretisch eingeführten Konzept eine Vielzahl an
ausführlich kommentierten Beispielen zu präsentieren.

Bedenken Sie bitte, dass dieses Skriptum kein Buch zum Thema C++
ersetzen kann. Aus zeitlichen Gründen muss ich viele Themenbereiche
entweder komplett auslassen, oder bin nur dazu in der Lage sie kurz
anzuschneiden. Sollten Sie Interesse an der Programmierung in C++
haben ist es sinnvoll sich weiterführende Literatur zum Thema zu
besorgen.
** Geschichte von C++
- 1979 :: Bjarne Stroustrup beginnt mit der Arbeit an "C with classes"
     (C mit Klassen). Es war als eine Erweiterung zu C gedacht welche
     die objektorientierte Programmierung in C erleichtert.
- 1983 :: Umbenennung in C++
- 1998 :: Erster ISO C++ Standard. C++ ist eine der wenigen Sprachen
     die offiziell standardisiert ist. Andere Beispiele sind C und
     Fortran. Es gibt keinen offiziellen Compiler für C++ (so wie es
     z.B. eine offizielle Version von Matlab, Java oder Python gibt).
     Daher war es wichtig einen Standard zu schaffen an den sich
     unterschiedliche Compiler halten können.
- 2011 :: Ein neuer ISO Standard wird veröffentlicht, der recht viel
     an der Sprache ändert. *Der C++11 Standard ist der Standard den
     wir in dieser Lehrveranstaltung verwenden werden.*
- 2014 :: ISO C++ 14. Kleine Änderungen am Standard. Betreffen uns in
     dieser Lehrveranstaltung nicht.
- 2017 :: ISO C++17. Größere Änderungen, aber nichts was uns in dieser
     Lehrveranstaltung berührt.
** Verwandschaft zu anderen Sprachen
C++ ist ursprünglich als eine Erweiterung zu C entwickelt worden um
die objektorientierte Programmierung zu erleichtern. Es ist daher
immer noch fast jeder C Code auch gültiger C++ Code. Über die Jahre
hat sich die Sprache C++ aber stark weiterenwickelt während die
Sprache C relativ unverändert geblieben ist. Heute ist es so, dass C
Code zwar prinzipiell auch gültiger C++ Code ist (mit kleinen
Ausnahmen), aber schön geschriebener C++ Code hat nicht mehr viel mit
C gemeinsam. Wenn C++ Code also aussieht wie C Code, dann ist er in
der Regel schlecht geschrieben.
