script/mci_cpp_script.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>C++ By Example</title>
<!-- 2018-03-21 Wed 00:05 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Sebastian Stabinger" />
<meta name="viewport" content="width=device-width, initial-scale=1"></head>
<body>
<div id="content">
<h1 class="title">C++ By Example</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Einführung</a>
<ul>
<li><a href="#sec-1-1">1.1. Geschichte von C++</a></li>
<li><a href="#sec-1-2">1.2. Verwandschaft zu anderen Sprachen</a></li>
<li><a href="#sec-1-3">1.3. Warum C++</a></li>
</ul>
</li>
<li><a href="#sec-2">2. C vs C++</a>
<ul>
<li><a href="#sec-2-1">2.1. Funktionsüberladung</a></li>
<li><a href="#sec-2-2">2.2. Verwendung komplexer Zahle</a></li>
<li><a href="#sec-2-3">2.3. Typinferenz</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Hello World</a>
<ul>
<li><a href="#sec-3-1">3.1. C</a></li>
<li><a href="#sec-3-2">3.2. C++</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Datentypen</a>
<ul>
<li><a href="#sec-4-1">4.1. Ganzzahlen</a></li>
<li><a href="#sec-4-2">4.2. Fließkommazahlen</a></li>
<li><a href="#sec-4-3">4.3. Welche Datentypen sollte man verwenden?</a></li>
<li><a href="#sec-4-4">4.4. Boolsche Werte</a></li>
<li><a href="#sec-4-5">4.5. <code>auto</code></a></li>
<li><a href="#sec-4-6">4.6. Strings</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Ein-/Ausgabe</a>
<ul>
<li><a href="#sec-5-1">5.1. Ausgabe</a></li>
<li><a href="#sec-5-2">5.2. Eingabe</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Einführung</h2>
<div class="outline-text-2" id="text-1">
<p>
Dieses Skriptum soll es Ihnen erleichtern dem Stoff der
Lehrveranstaltung <i>Programmieren 3</i> zu folgen. Es ist umfangreicher
als die Folien und enthält zudem mehr Beispiele als in der
Lehrveranstaltung selbst besprochen werden können. Zudem enthält das
Skriptum auch Teile die Ihnen bereits aus Ihren Lehrveranstaltungen zu
C bekannt sein sollten und für die in <i>Programmieren 3</i> keine Zeit zur
Wiederholung ist.
</p>

<p>
Ich bin der Auffassung, dass gerade Programmieranfänger von einer
großen Anzahl an präsentierten Beispielen profitieren. Ich versuche
daher zu jedem theoretisch eingeführten Konzept eine Vielzahl an
ausführlich kommentierten Beispielen zu präsentieren.
</p>

<p>
Bedenken Sie bitte, dass dieses Skriptum kein Buch zum Thema C++
ersetzen kann. Aus zeitlichen Gründen muss ich viele Themenbereiche
entweder komplett auslassen, oder bin nur dazu in der Lage sie kurz
anzuschneiden. Sollten Sie Interesse an der Programmierung in C++
haben ist es sinnvoll sich weiterführende Literatur zum Thema zu
besorgen.
</p>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Geschichte von C++</h3>
<div class="outline-text-3" id="text-1-1">
<dl class="org-dl">
<dt> 1979 </dt><dd>Bjarne Stroustrup beginnt mit der Arbeit an "C with classes"
(C mit Klassen). Es war als eine Erweiterung zu C gedacht welche
die objektorientierte Programmierung in C erleichtert.
</dd>
<dt> 1983 </dt><dd>Umbenennung in C++
</dd>
<dt> 1998 </dt><dd>Erster ISO C++ Standard. C++ ist eine der wenigen Sprachen
die offiziell standardisiert ist. Andere Beispiele sind C und
Fortran. Es gibt keinen offiziellen Compiler für C++ (so wie es
z.B. eine offizielle Version von Matlab, Java oder Python gibt).
Daher war es wichtig einen Standard zu schaffen an den sich
unterschiedliche Compiler halten können.
</dd>
<dt> 2011 </dt><dd>Ein neuer ISO Standard wird veröffentlicht, der recht viel
an der Sprache ändert. <b>Der C++11 Standard ist der Standard den
wir in dieser Lehrveranstaltung verwenden werden.</b>
</dd>
<dt> 2014 </dt><dd>ISO C++ 14. Kleine Änderungen am Standard. Betreffen uns in
dieser Lehrveranstaltung nicht.
</dd>
<dt> 2017 </dt><dd>ISO C++17. Größere Änderungen, aber nichts was uns in dieser
Lehrveranstaltung berührt.
</dd>
</dl>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Verwandschaft zu anderen Sprachen</h3>
<div class="outline-text-3" id="text-1-2">
<p>
C++ ist ursprünglich als eine Erweiterung zu C entwickelt worden um
die objektorientierte Programmierung zu erleichtern. Es ist daher
immer noch fast jeder C Code auch gültiger C++ Code. Über die Jahre
hat sich die Sprache C++ aber stark weiterenwickelt während die
Sprache C relativ unverändert geblieben ist. Heute ist es so, dass C
Code zwar prinzipiell auch gültiger C++ Code ist (mit kleinen
Ausnahmen), aber schön geschriebener C++ Code hat nicht mehr viel mit
C gemeinsam. Wenn C++ Code also aussieht wie C Code, dann ist er in
der Regel schlecht geschrieben.
</p>
</div>
</div>
