script/mci_cpp_script.org
** Warum C++
- Sehr schnell, geringer Speicherverbrauch :: C++ basiert auf dem
     Konzept, dass ein Programm keine Dinge tut die man nicht explizit
     angibt. Dadurch sind Programme die in C++ geschrieben sind
     generell relativ schnell und verbrauchen wenig Arbeitsspeicher.
- Hardwarenahe Programmierung :: C++ eignet sich genauso wie C für
     sehr hardwarenahe Programmierung. Man kann z.B. sehr genau
     bestimmen was bei der Ausführung in der CPU passiert, etc.
- Verwenden von C-Bibliotheken :: Durch die historische Nähe von C++
     zu C lassen sich C-Bibliotheken genauso einfach verwenden wie in
     C selbst. Das ist von Vorteil, da sehr viele C-Bibliotheken
     existieren. Speziell wenn man mit Hardware interagieren will,
     existiert üblicherweise eine C-Bibliotheken für diesen Zweck vom
     Hersteller.
- Flexibel :: C++ ist vermutlich die flexibelste Sprache hinsichtlich
     des Einsatzgebietes. Man kann vom Mikroprozessor, über
     PCs/Konsolen, bis hin zu High Performance Computing auf riesigen
     Clustern mit zehntausenden CPUs alles programmieren. Und C++ wird
     in all diesen Bereichen auch tagtäglich eingesetzt.
- Hohes Maß an Abstraktion :: Im Gegensatz zu C ist ein hohes Maß an
     Abstraktion möglich (OOP, Templates, Meta Template Programming,
     ...). Wir werden auf diese Dinge noch im Verlauf des Semesters
     genauer eingehen. Dieses höhere Maß an Abstraktion macht zwar die
     Sprache selbst komplexer (da es mehr Konzepte gibt die man lernen
     und verstehen muss), aber das Programmieren selbst wird dadurch
     letztlich einfacher wenn man die Konzepte verstanden hat.
- Grössere Standardbibliothek :: Im Gegensatz zu C inkludiert C++ eine
     wesentlich größere Standardbibliothek. Wir werden im Laufe des
     Semesters einige nützliche Bereiche der Standardbibliothek kennen
     lernen. Im Vergleich zu den Standardbibliotheken von Sprachen wie
     Java, Python, C#, ... ist sie aber immer noch relativ klein.
- Lange erprobt :: C++ existiert seit 35 Jahren und hat sich im
     industriellen Einsatz bewährt. Die Sprache hat ihre Probleme,
     aber man hat gelernt damit umzugehen. Es ist daher anzunehmen,
     dass die Sprache auch in Zukunft weiterhin ihren Platz haben
     wird. Im [[https://www.tiobe.com/tiobe-index/][TIOBE Index]] welcher Sprachen nach ihrer popularität
     bewertet ist C++ z.B. seit Jahrzehnten in den Top-5 (C ist seit
     Jahrzehnten abwechselnd auf Platz 1 oder 2)
- Sehr große Code Base :: Sehr viele Programme sind in C++
     geschrieben. Zum Beispiel sind faktisch alle Anwendungen (Office,
     Webbrowser, ...) in C++ geschrieben. Spiele auf PC oder Konsolen
     werden heutzutage auch fast durchgehend in C++ entwickelt. Es
     gibt also sehr viel C++ Code der gewartet und weiter entwickelt
     werden muss.

* C vs C++
Ich will Ihnen hier einen kleinen Vorgeschmack geben, wie einem C++
das Leben gegenüber C leichter machen kann. Dieses Kapitel ist als
Vorschau gedacht und soll Ihnen C++ schmackhaft machen. Sie müssen
noch nicht verstehen, was hier im Detail passiert.
** Funktionsüberladung
Angenommen Sie wollen eine Funktion schreiben mit der man das Quardat
einer Zahl bestimmen kann und Sie wollen diese Funktion für ~int~
(Ganzzahlen) als auch für ~double~ (Fließkommazahlen) implementieren.
*** In C
In C ist es nicht erlaubt zwei Funktionen mit dem gleichen Namen zu
definieren, selbst wenn die Datentypen der Parameter unterschiedlich
sind oder sie unterschiedliche Anzahl an Parametern haben. Wir müssen
also für unsere Funktion zwei verschiedene Namen wählen und bei der
Verwendung selbst daran denken die richtige Version zu verwenden.
#+BEGIN_SRC C
  int quadriere_int(int a) { return a * a; }
  double quadriere_double(double a) { return a * a; }

  int main() {
    int i = 2;
    double d = 2.0;

    int qi = quadriere_int(i);
    double qd = quadriere_double(d);
  }
#+END_SRC
