script/mci_cpp_script.html
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Warum C++</h3>
<div class="outline-text-3" id="text-1-3">
<dl class="org-dl">
<dt> Sehr schnell, geringer Speicherverbrauch </dt><dd>C++ basiert auf dem
Konzept, dass ein Programm keine Dinge tut die man nicht explizit
angibt. Dadurch sind Programme die in C++ geschrieben sind
generell relativ schnell und verbrauchen wenig Arbeitsspeicher.
</dd>
<dt> Hardwarenahe Programmierung </dt><dd>C++ eignet sich genauso wie C für
sehr hardwarenahe Programmierung. Man kann z.B. sehr genau
bestimmen was bei der Ausführung in der CPU passiert, etc.
</dd>
<dt> Verwenden von C-Bibliotheken </dt><dd>Durch die historische Nähe von C++
zu C lassen sich C-Bibliotheken genauso einfach verwenden wie in
C selbst. Das ist von Vorteil, da sehr viele C-Bibliotheken
existieren. Speziell wenn man mit Hardware interagieren will,
existiert üblicherweise eine C-Bibliotheken für diesen Zweck vom
Hersteller.
</dd>
<dt> Flexibel </dt><dd>C++ ist vermutlich die flexibelste Sprache hinsichtlich
des Einsatzgebietes. Man kann vom Mikroprozessor, über
PCs/Konsolen, bis hin zu High Performance Computing auf riesigen
Clustern mit zehntausenden CPUs alles programmieren. Und C++ wird
in all diesen Bereichen auch tagtäglich eingesetzt.
</dd>
<dt> Hohes Maß an Abstraktion </dt><dd>Im Gegensatz zu C ist ein hohes Maß an
Abstraktion möglich (OOP, Templates, Meta Template Programming,
&#x2026;). Wir werden auf diese Dinge noch im Verlauf des Semesters
genauer eingehen. Dieses höhere Maß an Abstraktion macht zwar die
Sprache selbst komplexer (da es mehr Konzepte gibt die man lernen
und verstehen muss), aber das Programmieren selbst wird dadurch
letztlich einfacher wenn man die Konzepte verstanden hat.
</dd>
<dt> Grössere Standardbibliothek </dt><dd>Im Gegensatz zu C inkludiert C++ eine
wesentlich größere Standardbibliothek. Wir werden im Laufe des
Semesters einige nützliche Bereiche der Standardbibliothek kennen
lernen. Im Vergleich zu den Standardbibliotheken von Sprachen wie
Java, Python, C#, &#x2026; ist sie aber immer noch relativ klein.
</dd>
<dt> Lange erprobt </dt><dd>C++ existiert seit 35 Jahren und hat sich im
industriellen Einsatz bewährt. Die Sprache hat ihre Probleme,
aber man hat gelernt damit umzugehen. Es ist daher anzunehmen,
dass die Sprache auch in Zukunft weiterhin ihren Platz haben
wird. Im <a href="https://www.tiobe.com/tiobe-index/">TIOBE Index</a> welcher Sprachen nach ihrer popularität
bewertet ist C++ z.B. seit Jahrzehnten in den Top-5 (C ist seit
Jahrzehnten abwechselnd auf Platz 1 oder 2)
</dd>
<dt> Sehr große Code Base </dt><dd>Sehr viele Programme sind in C++
geschrieben. Zum Beispiel sind faktisch alle Anwendungen (Office,
Webbrowser, &#x2026;) in C++ geschrieben. Spiele auf PC oder Konsolen
werden heutzutage auch fast durchgehend in C++ entwickelt. Es
gibt also sehr viel C++ Code der gewartet und weiter entwickelt
werden muss.
</dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> C vs C++</h2>
<div class="outline-text-2" id="text-2">
<p>
Ich will Ihnen hier einen kleinen Vorgeschmack geben, wie einem C++
das Leben gegenüber C leichter machen kann. Dieses Kapitel ist als
Vorschau gedacht und soll Ihnen C++ schmackhaft machen. Sie müssen
noch nicht verstehen, was hier im Detail passiert.
</p>
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Funktionsüberladung</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Angenommen Sie wollen eine Funktion schreiben mit der man das Quardat
einer Zahl bestimmen kann und Sie wollen diese Funktion für <code>int</code>
(Ganzzahlen) als auch für <code>double</code> (Fließkommazahlen) implementieren.
</p>
</div>
<div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> In C</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
In C ist es nicht erlaubt zwei Funktionen mit dem gleichen Namen zu
definieren, selbst wenn die Datentypen der Parameter unterschiedlich
sind oder sie unterschiedliche Anzahl an Parametern haben. Wir müssen
also für unsere Funktion zwei verschiedene Namen wählen und bei der
Verwendung selbst daran denken die richtige Version zu verwenden.
</p>
<div class="org-src-container">

<pre class="src src-C"><span class="org-type">int</span> <span class="org-function-name">quadriere_int</span>(<span class="org-type">int</span> <span class="org-variable-name">a</span>) { <span class="org-keyword">return</span> a * a; }
<span class="org-type">double</span> <span class="org-function-name">quadriere_double</span>(<span class="org-type">double</span> <span class="org-variable-name">a</span>) { <span class="org-keyword">return</span> a * a; }

<span class="org-type">int</span> <span class="org-function-name">main</span>() {
  <span class="org-type">int</span> <span class="org-variable-name">i</span> = 2;
  <span class="org-type">double</span> <span class="org-variable-name">d</span> = 2.0;

  <span class="org-type">int</span> <span class="org-variable-name">qi</span> = quadriere_int(i);
  <span class="org-type">double</span> <span class="org-variable-name">qd</span> = quadriere_double(d);
}
</pre>
</div>
</div>
</div>
