script/mci_cpp_script.org
*** In C++
In C++ können wir mehreren Funktionen den gleichen Namen geben, so
lange die Datentypen der Parameter unterschiedlich sind. Der C++
Compiler wählt dann anhand der Datentypen automatisch die richtige
Version aus. Man bezeichnet das als *[[https://msdn.microsoft.com/de-de/library/5dhe1hce.aspx][Funktionsüberladung]]* (function
overloading) . In unserem Fall können wir also für die Quadrierfunktion
für ~int~ und für ~double~ den gleichen Namen wählen und der Compiler
verwendet automatisch die richtige Version.
#+BEGIN_SRC C++
  int quadriere(int a) { return a * a; }
  double quadriere(double a) { return a * a; }

  int main() {
    int i = 2;
    double d = 2.0;

    int qi = quadriere(i);
    double qd = quadriere(d);
  }
#+END_SRC
*** In C++ mit Templates
Wir haben aber immer noch das Problem, dass wir für jeden Datentyp
eine eigene Version unserer Quadrierfunktion implementieren müssen
obwohl ja unabhängig vom Typ immer das gleiche passiert (es wird
einfach der übergebene Parameter mit sich selbst multipliziert). C++
ermöglicht es mittels sogenannter Templates, Funktionen zu schreiben
welche automatisch für alle Typen funktionieren welche z.B. die
Multiplikation unterstüzen.
#+BEGIN_SRC C++
  template <typename T> T quadriere(T a) { return a * a; }

  int main() {
    int i = 2;
    unsigned int ui = 2;
    short d = 2;
    double d = 2.0;

    int qi = quadriere(i);
    unsigned int qui = quadriere(ui);
    short qs = quadriere(s);
    double qd = quadriere(d);
  }
#+END_SRC
Das ~T~ dient hier als ein Platzhalter für beliebige Datentypen.
** Verwendung komplexer Zahle
Angenommen wir wollen das Ergebnis dieser Formel berechnen und müssen
daher mit komplexen Zahen rechnen: $$d=\frac{(1.3+5i)+5}{(3.4+1i)^2}$$
Sowohl C als auch C++ bieten über ihre Standardbibliothek das Rechnen
mit komplexen Zahlen an. *Achtung:* Die folgenden Beispiele verwenden
nicht die Implementierungen wie sie von C und C++ zur Verfügung
gestellt werden. Die Beispiele verdeutlichen nur, wie eine
Implementierung aussehen könnte.
*** In C
Da C nur sehr wenige Möglichkeiten zur Abstraktion bietet müssen alle
Operationen über Funktionen realisiert werden. Es ist in C z.B. nicht
möglich eigenes Verhalten für ~+~ zu implementieren. Wir müssen daher
zum Addieren von zwei komplexen Zahlen die Funktion ~complex_add~
verwenden, etc. Das macht den Code sehr unleserlich.
#+BEGIN_SRC C
  struct complex d =
      complex_div(complex_add(create_complex(1.3, 5), create_complex(5, 0)),
                  complex_pow(create_complex(3.4, 1.0), 2));
#+END_SRC

*** In C++
C++ erlaubt die Implementierung von eigenen Versionen von ~+~, ~*~,
... Man bezeichnet dies als [[https://de.wikipedia.org/wiki/%25C3%259Cberladen#Operator%C3%BCberladung][Operatorüberladung]] (operator overloading).
Dadurch wir Code häufig leichter lesbar.
#+BEGIN_SRC C++
  complex d = (complex(1.3, 5.0) + 5.0) / complex(3.4, 1.0) ^ 2.0;
#+END_SRC

** Typinferenz
In C müssen wir den Datentyp einer Variable angeben, auch wenn der
Compiler eigentlich selbst herausfinden könnte welchen Datentyp die
Variable haben muss. Angenommen wir haben folgende Funktionen gegeben:
#+BEGIN_SRC C++
  struct some_long_name get_struct();
  void do_something_with_struct(struct some_long_name a);
#+END_SRC
Wir wollen nun mittels ~get_struct~ eine Variable befüllen und diese
dann mittels ~do_something_with_struct~ weiterverarbeiten.
*** Verwendung in C
In C müssen wir den Datentyp der Variable ~mystruct~ explizit angeben,
obwohl der Compiler ja selbst herausfinden könnte welchen Datentyp
~get_struct~ zurück gibt und den selben Typ für die Variable verwenden
könnte.
#+BEGIN_SRC C
  struct some_long_name mystruct = get_struct();
  // ...
  do_something_with_struct(mystruct);
#+END_SRC
