script/mci_cpp_script.html
<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> In C++</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
In C++ können wir mehreren Funktionen den gleichen Namen geben, so
lange die Datentypen der Parameter unterschiedlich sind. Der C++
Compiler wählt dann anhand der Datentypen automatisch die richtige
Version aus. Man bezeichnet das als <b><a href="https://msdn.microsoft.com/de-de/library/5dhe1hce.aspx">Funktionsüberladung</a></b> (function
overloading) . In unserem Fall können wir also für die Quadrierfunktion
für <code>int</code> und für <code>double</code> den gleichen Namen wählen und der Compiler
verwendet automatisch die richtige Version.
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-type">int</span> <span class="org-function-name">quadriere</span>(<span class="org-type">int</span> <span class="org-variable-name">a</span>) { <span class="org-keyword">return</span> a * a; }
<span class="org-type">double</span> <span class="org-function-name">quadriere</span>(<span class="org-type">double</span> <span class="org-variable-name">a</span>) { <span class="org-keyword">return</span> a * a; }

<span class="org-type">int</span> <span class="org-function-name">main</span>() {
  <span class="org-type">int</span> <span class="org-variable-name">i</span> = 2;
  <span class="org-type">double</span> <span class="org-variable-name">d</span> = 2.0;

  <span class="org-type">int</span> <span class="org-variable-name">qi</span> = quadriere(i);
  <span class="org-type">double</span> <span class="org-variable-name">qd</span> = quadriere(d);
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-1-3" class="outline-4">
<h4 id="sec-2-1-3"><span class="section-number-4">2.1.3</span> In C++ mit Templates</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
Wir haben aber immer noch das Problem, dass wir für jeden Datentyp
eine eigene Version unserer Quadrierfunktion implementieren müssen
obwohl ja unabhängig vom Typ immer das gleiche passiert (es wird
einfach der übergebene Parameter mit sich selbst multipliziert). C++
ermöglicht es mittels sogenannter Templates, Funktionen zu schreiben
welche automatisch für alle Typen funktionieren welche z.B. die
Multiplikation unterstüzen.
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-keyword">template</span> &lt;<span class="org-keyword">typename</span> <span class="org-type">T</span>&gt; <span class="org-type">T</span> <span class="org-function-name">quadriere</span>(<span class="org-type">T</span> <span class="org-variable-name">a</span>) { <span class="org-keyword">return</span> a * a; }

<span class="org-type">int</span> <span class="org-function-name">main</span>() {
  <span class="org-type">int</span> <span class="org-variable-name">i</span> = 2;
  <span class="org-type">unsigned</span> <span class="org-type">int</span> <span class="org-variable-name">ui</span> = 2;
  <span class="org-type">short</span> <span class="org-variable-name">d</span> = 2;
  <span class="org-type">double</span> <span class="org-variable-name">d</span> = 2.0;

  <span class="org-type">int</span> <span class="org-variable-name">qi</span> = quadriere(i);
  <span class="org-type">unsigned</span> <span class="org-type">int</span> <span class="org-variable-name">qui</span> = quadriere(ui);
  <span class="org-type">short</span> <span class="org-variable-name">qs</span> = quadriere(s);
  <span class="org-type">double</span> <span class="org-variable-name">qd</span> = quadriere(d);
}
</pre>
</div>
<p>
Das <code>T</code> dient hier als ein Platzhalter für beliebige Datentypen.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Verwendung komplexer Zahle</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Angenommen wir wollen das Ergebnis dieser Formel berechnen und müssen
daher mit komplexen Zahen rechnen: $$d=\frac{(1.3+5i)+5}{(3.4+1i)^2}$$
Sowohl C als auch C++ bieten über ihre Standardbibliothek das Rechnen
mit komplexen Zahlen an. <b>Achtung:</b> Die folgenden Beispiele verwenden
nicht die Implementierungen wie sie von C und C++ zur Verfügung
gestellt werden. Die Beispiele verdeutlichen nur, wie eine
Implementierung aussehen könnte.
</p>
</div>
<div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> In C</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
Da C nur sehr wenige Möglichkeiten zur Abstraktion bietet müssen alle
Operationen über Funktionen realisiert werden. Es ist in C z.B. nicht
möglich eigenes Verhalten für <code>+</code> zu implementieren. Wir müssen daher
zum Addieren von zwei komplexen Zahlen die Funktion <code>complex_add</code>
verwenden, etc. Das macht den Code sehr unleserlich.
</p>
<div class="org-src-container">

<pre class="src src-C"><span class="org-keyword">struct</span> <span class="org-type">complex</span> <span class="org-variable-name">d</span> =
    complex_div(complex_add(create_complex(1.3, 5), create_complex(5, 0)),
                complex_pow(create_complex(3.4, 1.0), 2));
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> In C++</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
C++ erlaubt die Implementierung von eigenen Versionen von <code>+</code>, <code>*</code>,
&#x2026; Man bezeichnet dies als <a href="https://de.wikipedia.org/wiki/%25C3%259Cberladen#Operator%C3%BCberladung">Operatorüberladung</a> (operator overloading).
Dadurch wir Code häufig leichter lesbar.
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-type">complex</span> <span class="org-variable-name">d</span> = (complex(1.3, 5.0) + 5.0) / complex(3.4, 1.0) ^ 2.0;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Typinferenz</h3>
<div class="outline-text-3" id="text-2-3">
<p>
In C müssen wir den Datentyp einer Variable angeben, auch wenn der
Compiler eigentlich selbst herausfinden könnte welchen Datentyp die
Variable haben muss. Angenommen wir haben folgende Funktionen gegeben:
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-keyword">struct</span> <span class="org-type">some_long_name</span> <span class="org-function-name">get_struct</span>();
<span class="org-type">void</span> <span class="org-function-name">do_something_with_struct</span>(<span class="org-keyword">struct</span> <span class="org-type">some_long_name</span> <span class="org-variable-name">a</span>);
</pre>
</div>
<p>
Wir wollen nun mittels <code>get_struct</code> eine Variable befüllen und diese
dann mittels <code>do_something_with_struct</code> weiterverarbeiten.
</p>
</div>
<div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> Verwendung in C</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
In C müssen wir den Datentyp der Variable <code>mystruct</code> explizit angeben,
obwohl der Compiler ja selbst herausfinden könnte welchen Datentyp
<code>get_struct</code> zurück gibt und den selben Typ für die Variable verwenden
könnte.
</p>
<div class="org-src-container">

<pre class="src src-C"><span class="org-keyword">struct</span> <span class="org-type">some_long_name</span> <span class="org-variable-name">mystruct</span> = get_struct();
<span class="org-comment-delimiter">// </span><span class="org-comment">...</span>
do_something_with_struct(mystruct);
</pre>
</div>
</div>
</div>
