script/mci_cpp_script.tex
\subsubsection{In C++}
\label{sec-2-1-2}
In C++ können wir mehreren Funktionen den gleichen Namen geben, so
lange die Datentypen der Parameter unterschiedlich sind. Der C++
Compiler wählt dann anhand der Datentypen automatisch die richtige
Version aus. Man bezeichnet das als \textbf{\href{https://msdn.microsoft.com/de-de/library/5dhe1hce.aspx}{Funktionsüberladung}} (function
overloading) . In unserem Fall können wir also für die Quadrierfunktion
für \verb~int~ und für \verb~double~ den gleichen Namen wählen und der Compiler
verwendet automatisch die richtige Version.
\begin{minted}[fontsize=\scriptsize,numberblanklines=false]{c++}
int quadriere(int a) { return a * a; }
double quadriere(double a) { return a * a; }

int main() {
  int i = 2;
  double d = 2.0;

  int qi = quadriere(i);
  double qd = quadriere(d);
}
\end{minted}
\subsubsection{In C++ mit Templates}
\label{sec-2-1-3}
Wir haben aber immer noch das Problem, dass wir für jeden Datentyp
eine eigene Version unserer Quadrierfunktion implementieren müssen
obwohl ja unabhängig vom Typ immer das gleiche passiert (es wird
einfach der übergebene Parameter mit sich selbst multipliziert). C++
ermöglicht es mittels sogenannter Templates, Funktionen zu schreiben
welche automatisch für alle Typen funktionieren welche z.B. die
Multiplikation unterstüzen.
\begin{minted}[fontsize=\scriptsize,numberblanklines=false]{c++}
template <typename T> T quadriere(T a) { return a * a; }

int main() {
  int i = 2;
  unsigned int ui = 2;
  short d = 2;
  double d = 2.0;

  int qi = quadriere(i);
  unsigned int qui = quadriere(ui);
  short qs = quadriere(s);
  double qd = quadriere(d);
}
\end{minted}
Das \verb~T~ dient hier als ein Platzhalter für beliebige Datentypen.
\subsection{Verwendung komplexer Zahle}
\label{sec-2-2}
Angenommen wir wollen das Ergebnis dieser Formel berechnen und müssen
daher mit komplexen Zahen rechnen: $$d=\frac{(1.3+5i)+5}{(3.4+1i)^2}$$
Sowohl C als auch C++ bieten über ihre Standardbibliothek das Rechnen
mit komplexen Zahlen an. \textbf{Achtung:} Die folgenden Beispiele verwenden
nicht die Implementierungen wie sie von C und C++ zur Verfügung
gestellt werden. Die Beispiele verdeutlichen nur, wie eine
Implementierung aussehen könnte.
\subsubsection{In C}
\label{sec-2-2-1}
Da C nur sehr wenige Möglichkeiten zur Abstraktion bietet müssen alle
Operationen über Funktionen realisiert werden. Es ist in C z.B. nicht
möglich eigenes Verhalten für \verb~+~ zu implementieren. Wir müssen daher
zum Addieren von zwei komplexen Zahlen die Funktion \verb~complex_add~
verwenden, etc. Das macht den Code sehr unleserlich.
\begin{minted}[fontsize=\scriptsize,numberblanklines=false]{c}
struct complex d =
    complex_div(complex_add(create_complex(1.3, 5), create_complex(5, 0)),
                complex_pow(create_complex(3.4, 1.0), 2));
\end{minted}

\subsubsection{In C++}
\label{sec-2-2-2}
C++ erlaubt die Implementierung von eigenen Versionen von \verb~+~, \verb~*~,
\ldots{} Man bezeichnet dies als \href{https://de.wikipedia.org/wiki/\%25C3\%259Cberladen#Operator\%C3\%BCberladung}{Operatorüberladung} (operator overloading).
Dadurch wir Code häufig leichter lesbar.
\begin{minted}[fontsize=\scriptsize,numberblanklines=false]{c++}
complex d = (complex(1.3, 5.0) + 5.0) / complex(3.4, 1.0) ^ 2.0;
\end{minted}

\subsection{Typinferenz}
\label{sec-2-3}
In C müssen wir den Datentyp einer Variable angeben, auch wenn der
Compiler eigentlich selbst herausfinden könnte welchen Datentyp die
Variable haben muss. Angenommen wir haben folgende Funktionen gegeben:
\begin{minted}[fontsize=\scriptsize,numberblanklines=false]{c++}
struct some_long_name get_struct();
void do_something_with_struct(struct some_long_name a);
\end{minted}
Wir wollen nun mittels \verb~get_struct~ eine Variable befüllen und diese
dann mittels \verb~do_something_with_struct~ weiterverarbeiten.
\subsubsection{Verwendung in C}
\label{sec-2-3-1}
In C müssen wir den Datentyp der Variable \verb~mystruct~ explizit angeben,
obwohl der Compiler ja selbst herausfinden könnte welchen Datentyp
\verb~get_struct~ zurück gibt und den selben Typ für die Variable verwenden
könnte.
\begin{minted}[fontsize=\scriptsize,numberblanklines=false]{c}
struct some_long_name mystruct = get_struct();
// ...
do_something_with_struct(mystruct);
\end{minted}
