script/mci_cpp_script.org
*** Verwendung in C++(11)
Seit C++11 unterstützt C++ eine einfache Form der [[https://de.wikipedia.org/wiki/Typinferenz][Typinferenz]]. Dadurch
muss der Datentyp einer Variable nicht angegeben werden, falls der
Compiler den Datentyp selbst bestimmen kann. Um den Compiler zu
veranlassen den Datentyp selbst zu bestimmen, wird statt des Datentyps
das Schlüsselwort ~auto~ verwendet.
#+BEGIN_SRC C++
  auto mystruct = get_struct();
  // ...
  do_something_with_struct(mystruct);
#+END_SRC
~auto~ findet den Typ einer Variable also automatisch.
#+BEGIN_SRC C++
  auto i = 42;   // i ist vom Typ int
  auto d = 23.4; // d ist vom Typ double
  auto c = 'A';  // c ist vom Typ char
#+END_SRC
* Hello World
Heute ist es üblich, als erstes Beispiel einer Programmiersprache das
sogenannte "[[https://de.wikipedia.org/wiki/Hallo-Welt-Programm][Hello World]]" Programm zu implementieren. Es handelt sich
dabei um ein Programm welches einfach den Text "Hello World" auf dem
Bildschirm ausgibt. Begonnen hat diese Tradition im Buch [[https://de.wikipedia.org/wiki/The_C_Programming_Language][The C
Programming Language]] (DAS Standardwerk zu C) von Kernighan und
Ritchie. Es folgt ein Vergleich dieses Programms in C (welches Sie
bereits kennen sollten) und C++.
** C
#+BEGIN_SRC C
  #include <stdio.h>
  int main() {
      printf("Hello World\n");
  }
#+END_SRC
Die Headerdatei ~stdio.h~ wird eingebunden um ~printf~ verwenden zu
können. Die Funktion ~main~ ist die Funktion die bei Ausführung eines
Programms als erstes aufgerufen wird. Die Funktion ~printf~ ist der
Standardweg um Text in C auf dem Bildschirm auszugeben.
** C++
#+BEGIN_SRC C++
  #include <iostream>
  int main() {
      std::cout << "Hello World" << std::endl;
  }
#+END_SRC
Hier wird der Header für ~iostream~ eingebunden um ~std::cout~
verwenden zu können. Bei C++ ist es üblich die Dateierweiterung ~.h~
bei Headerdateien wegzulassen. In C++ ist ~std::cout~ der Standardweg
um Text auf dem Bildschirm auszugeben. Der Bezeichner ~std::endl~
bewirkt das gleiche wie ~\n~ in C (ein Zeilenumbruch wird eingefügt).
** COMMENT C++ mit Visual Studio
*** Anlegen eines Projekts
*** Schließen der Ausgabe verhindern
* Datentypen
Alle Datentypen die in C verfügbar sind können und werden auch in C++
verwendet.
