script/mci_cpp_script.html
<div id="outline-container-sec-2-3-2" class="outline-4">
<h4 id="sec-2-3-2"><span class="section-number-4">2.3.2</span> Verwendung in C++(11)</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
Seit C++11 unterstützt C++ eine einfache Form der <a href="https://de.wikipedia.org/wiki/Typinferenz">Typinferenz</a>. Dadurch
muss der Datentyp einer Variable nicht angegeben werden, falls der
Compiler den Datentyp selbst bestimmen kann. Um den Compiler zu
veranlassen den Datentyp selbst zu bestimmen, wird statt des Datentyps
das Schlüsselwort <code>auto</code> verwendet.
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-keyword">auto</span> <span class="org-variable-name">mystruct</span> = get_struct();
<span class="org-comment-delimiter">// </span><span class="org-comment">...</span>
do_something_with_struct(mystruct);
</pre>
</div>
<p>
<code>auto</code> findet den Typ einer Variable also automatisch.
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-keyword">auto</span> <span class="org-variable-name">i</span> = 42;   <span class="org-comment-delimiter">// </span><span class="org-comment">i ist vom Typ int</span>
<span class="org-keyword">auto</span> <span class="org-variable-name">d</span> = 23.4; <span class="org-comment-delimiter">// </span><span class="org-comment">d ist vom Typ double</span>
<span class="org-keyword">auto</span> <span class="org-variable-name">c</span> = <span class="org-string">'A'</span>;  <span class="org-comment-delimiter">// </span><span class="org-comment">c ist vom Typ char</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Hello World</h2>
<div class="outline-text-2" id="text-3">
<p>
Heute ist es üblich, als erstes Beispiel einer Programmiersprache das
sogenannte "<a href="https://de.wikipedia.org/wiki/Hallo-Welt-Programm">Hello World</a>" Programm zu implementieren. Es handelt sich
dabei um ein Programm welches einfach den Text "Hello World" auf dem
Bildschirm ausgibt. Begonnen hat diese Tradition im Buch <a href="https://de.wikipedia.org/wiki/The_C_Programming_Language">The C
Programming Language</a> (DAS Standardwerk zu C) von Kernighan und
Ritchie. Es folgt ein Vergleich dieses Programms in C (welches Sie
bereits kennen sollten) und C++.
</p>
</div>
<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> C</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-C"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;stdio.h&gt;</span>
<span class="org-type">int</span> <span class="org-function-name">main</span>() {
    printf(<span class="org-string">"Hello World\n"</span>);
}
</pre>
</div>
<p>
Die Headerdatei <code>stdio.h</code> wird eingebunden um <code>printf</code> verwenden zu
können. Die Funktion <code>main</code> ist die Funktion die bei Ausführung eines
Programms als erstes aufgerufen wird. Die Funktion <code>printf</code> ist der
Standardweg um Text in C auf dem Bildschirm auszugeben.
</p>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> C++</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">

<pre class="src src-C++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;iostream&gt;</span>
<span class="org-type">int</span> <span class="org-function-name">main</span>() {
    <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Hello World"</span> &lt;&lt; <span class="org-constant">std</span>::endl;
}
</pre>
</div>
<p>
Hier wird der Header für <code>iostream</code> eingebunden um <code>std::cout</code>
verwenden zu können. Bei C++ ist es üblich die Dateierweiterung <code>.h</code>
bei Headerdateien wegzulassen. In C++ ist <code>std::cout</code> der Standardweg
um Text auf dem Bildschirm auszugeben. Der Bezeichner <code>std::endl</code>
bewirkt das gleiche wie <code>\n</code> in C (ein Zeilenumbruch wird eingefügt).
</p>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Datentypen</h2>
<div class="outline-text-2" id="text-4">
<p>
Alle Datentypen die in C verfügbar sind können und werden auch in C++
verwendet.
</p>
</div>
