script/mci_cpp_script.tex
\subsubsection{Verwendung in C++(11)}
\label{sec-2-3-2}
Seit C++11 unterstützt C++ eine einfache Form der \href{https://de.wikipedia.org/wiki/Typinferenz}{Typinferenz}. Dadurch
muss der Datentyp einer Variable nicht angegeben werden, falls der
Compiler den Datentyp selbst bestimmen kann. Um den Compiler zu
veranlassen den Datentyp selbst zu bestimmen, wird statt des Datentyps
das Schlüsselwort \verb~auto~ verwendet.
\begin{minted}[fontsize=\scriptsize,numberblanklines=false]{c++}
auto mystruct = get_struct();
// ...
do_something_with_struct(mystruct);
\end{minted}
\verb~auto~ findet den Typ einer Variable also automatisch.
\begin{minted}[fontsize=\scriptsize,numberblanklines=false]{c++}
auto i = 42;   // i ist vom Typ int
auto d = 23.4; // d ist vom Typ double
auto c = 'A';  // c ist vom Typ char
\end{minted}
\section{Hello World}
\label{sec-3}
Heute ist es üblich, als erstes Beispiel einer Programmiersprache das
sogenannte "\href{https://de.wikipedia.org/wiki/Hallo-Welt-Programm}{Hello World}" Programm zu implementieren. Es handelt sich
dabei um ein Programm welches einfach den Text "Hello World" auf dem
Bildschirm ausgibt. Begonnen hat diese Tradition im Buch \href{https://de.wikipedia.org/wiki/The_C_Programming_Language}{The C
Programming Language} (DAS Standardwerk zu C) von Kernighan und
Ritchie. Es folgt ein Vergleich dieses Programms in C (welches Sie
bereits kennen sollten) und C++.
\subsection{C}
\label{sec-3-1}
\begin{minted}[fontsize=\scriptsize,numberblanklines=false]{c}
#include <stdio.h>
int main() {
    printf("Hello World\n");
}
\end{minted}
Die Headerdatei \verb~stdio.h~ wird eingebunden um \verb~printf~ verwenden zu
können. Die Funktion \verb~main~ ist die Funktion die bei Ausführung eines
Programms als erstes aufgerufen wird. Die Funktion \verb~printf~ ist der
Standardweg um Text in C auf dem Bildschirm auszugeben.
\subsection{C++}
\label{sec-3-2}
\begin{minted}[fontsize=\scriptsize,numberblanklines=false]{c++}
#include <iostream>
int main() {
    std::cout << "Hello World" << std::endl;
}
\end{minted}
Hier wird der Header für \verb~iostream~ eingebunden um \verb~std::cout~
verwenden zu können. Bei C++ ist es üblich die Dateierweiterung \verb~.h~
bei Headerdateien wegzulassen. In C++ ist \verb~std::cout~ der Standardweg
um Text auf dem Bildschirm auszugeben. Der Bezeichner \verb~std::endl~
bewirkt das gleiche wie \verb~\n~ in C (ein Zeilenumbruch wird eingefügt).
\section{Datentypen}
\label{sec-4}
Alle Datentypen die in C verfügbar sind können und werden auch in C++
verwendet.
