script/mci_cpp_script.org
** Ganzzahlen
Ganzzahlen werden verwendet um ganze Zahlen (ohne Kommastellen) zu
speichern. Die unterschiedlichen Datentypen für Ganzzahlen
unterscheiden sich hinsichtlich der Wertebereiche welche in ihnen
gespeichert werden können und wie viel Speicher eine einzelne Zahl
belegt.

Leider ist die Größe dieser Datentypen in C nicht standardisiert (es
ist nur die minimale Größe spezifiziert). Sollte man garantierte
Größen benötigen kann man (seit C99) den Header ~stdint.h~ verwenden
([[http://openbook.rheinwerk-verlag.de/c_von_a_bis_z/030_c_anhang_b_017.htm][weitere Info]]). Auf einem aktuellen PC mit 64 Bit Architektur sind
folgende Größen üblich. Auf Mikroprozessoren und Embedded Devices
können die Größen stark von dieser Tabelle abweichen.

| Bezeichner           | Übliche Größe auf PC | Üblicher Wertebereich auf PC                 |
|----------------------+----------------------+----------------------------------------------|
| ~char~               | 8 Bit                | -128 ... 127                                 |
| ~unsigned char~      | 8 Bit                | 0 ... 255                                    |
| ~short~              | 16 Bit               | -32768 ... 32767                             |
| ~unsiged short~      | 16 Bit               | 0 ... 65536                                  |
| ~int~                | 32 Bit               | -2147483648 ... 2147483647                   |
| ~unsigned int~       | 32 Bit               | 0 ... 4294967296                             |
| ~long~               | 32/64 Bit            | -9223372036854775808 ... 9223372036854775807 |
| ~unsigned long~      | 32/64 Bit            | 0 ... 18446744073709551616                   |
| ~long long~          | 64 Bit               | -9223372036854775808 ... 9223372036854775807 |
| ~unsigned long long~ | 64 Bit               | 0 ... 18446744073709551616                   |

Ganzzahlen mit mehr als 64 Bit werden üblicherweise nicht direkt von C
unterstützt (einige Compiler unterstützen noch 128 Bit Ganzzahlen).
Falls man größere Zahlen benötigt muss eine externe Bibliothek, z.B.
[[https://gmplib.org/][GMP]] , verwendet werden. Mit dieser Bibliothek sind beliebig große
Ganzzahlen möglich.
** Fließkommazahlen
Fließkommazahlen sind eine Möglichkeit Zahlen mit Nachkommastellen in
einem Computer darzustellen. Die Anzahl der Nachkommastellen ist nicht
fix vorgegeben. Daher der Name *Fließ*-kommazahlen. C kennt die
folgenden Datentypen für Fließkommazahlen.

| Bezeichner    | Größe   | Wertebereich      | Genauigkeit    |
|---------------+---------+-------------------+----------------|
| ~float~       | 32 Bit  | $\pm3.4*10^{38}$  | ca. 7 Stellen  |
| ~double~      | 64 Bit  | $\pm2.3*10^{308}$ | ca. 16 Stellen |
| ~long double~ | 128 Bit | $\pm3.4*10^{4932}$ | ca. 19 Stellen |

#+BEGIN_SRC C++
  auto pi = 3.14159265358979323846;
  auto tau = 2 * pi;
  auto ganz = 3.0; // Auch 3.0 ist eine Kommazahl (mit .0000 als Kommastellen)
  auto ganz2 = 4.; // Ein . ist ausreichend um eine Fließkommazahl zu erzeugen
  auto expo = 3e3; // Exponentialschreibweise. Entspricht 3*10^3
  double kein_integer = 23; // Wird automatisch in 23.0 umgewandelt

#+END_SRC
*** COMMENT Wie Funktionieren Fließkommazahlen?
** Welche Datentypen sollte man verwenden?
*Generell faktisch immer ~int~ und ~double~* 

C und C++ unterstützen sehr viele unterschiedliche Datentypen für
Zahlen, aber nur wenige sind ohne spezielle Gründe sinnvoll. Falls Sie
keine SEHR guten Gründe haben, sollten Sie generell ~int~ und ~double~
verwenden. Gute Gründe sind fast ausschließlich die Interaktion mit
Hardware welche bestimmte Datentypen benötigen.

Das Rechnen mit ~short~ und ~float~ ist auf PCs *nicht generell
schneller* als das Rechnen mit ~int~ und ~double~ und häufig sogar
langsamer.

Der Datentyp ~char~ stellt eine Ausnahme dar da er zum Speichern von
Zeichen verwendet wird.
