script/mci_cpp_script.html
<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Ganzzahlen</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Ganzzahlen werden verwendet um ganze Zahlen (ohne Kommastellen) zu
speichern. Die unterschiedlichen Datentypen für Ganzzahlen
unterscheiden sich hinsichtlich der Wertebereiche welche in ihnen
gespeichert werden können und wie viel Speicher eine einzelne Zahl
belegt.
</p>

<p>
Leider ist die Größe dieser Datentypen in C nicht standardisiert (es
ist nur die minimale Größe spezifiziert). Sollte man garantierte
Größen benötigen kann man (seit C99) den Header <code>stdint.h</code> verwenden
(<a href="http://openbook.rheinwerk-verlag.de/c_von_a_bis_z/030_c_anhang_b_017.htm">weitere Info</a>). Auf einem aktuellen PC mit 64 Bit Architektur sind
folgende Größen üblich. Auf Mikroprozessoren und Embedded Devices
können die Größen stark von dieser Tabelle abweichen.
</p>

<table cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Bezeichner</th>
<th scope="col" class="left">Übliche Größe auf PC</th>
<th scope="col" class="left">Üblicher Wertebereich auf PC</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>char</code></td>
<td class="left">8 Bit</td>
<td class="left">-128 &#x2026; 127</td>
</tr>

<tr>
<td class="left"><code>unsigned char</code></td>
<td class="left">8 Bit</td>
<td class="left">0 &#x2026; 255</td>
</tr>

<tr>
<td class="left"><code>short</code></td>
<td class="left">16 Bit</td>
<td class="left">-32768 &#x2026; 32767</td>
</tr>

<tr>
<td class="left"><code>unsiged short</code></td>
<td class="left">16 Bit</td>
<td class="left">0 &#x2026; 65536</td>
</tr>

<tr>
<td class="left"><code>int</code></td>
<td class="left">32 Bit</td>
<td class="left">-2147483648 &#x2026; 2147483647</td>
</tr>

<tr>
<td class="left"><code>unsigned int</code></td>
<td class="left">32 Bit</td>
<td class="left">0 &#x2026; 4294967296</td>
</tr>

<tr>
<td class="left"><code>long</code></td>
<td class="left">32/64 Bit</td>
<td class="left">-9223372036854775808 &#x2026; 9223372036854775807</td>
</tr>

<tr>
<td class="left"><code>unsigned long</code></td>
<td class="left">32/64 Bit</td>
<td class="left">0 &#x2026; 18446744073709551616</td>
</tr>

<tr>
<td class="left"><code>long long</code></td>
<td class="left">64 Bit</td>
<td class="left">-9223372036854775808 &#x2026; 9223372036854775807</td>
</tr>

<tr>
<td class="left"><code>unsigned long long</code></td>
<td class="left">64 Bit</td>
<td class="left">0 &#x2026; 18446744073709551616</td>
</tr>
</tbody>
</table>

<p>
Ganzzahlen mit mehr als 64 Bit werden üblicherweise nicht direkt von C
unterstützt (einige Compiler unterstützen noch 128 Bit Ganzzahlen).
Falls man größere Zahlen benötigt muss eine externe Bibliothek, z.B.
<a href="https://gmplib.org/">GMP</a> , verwendet werden. Mit dieser Bibliothek sind beliebig große
Ganzzahlen möglich.
</p>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Fließkommazahlen</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Fließkommazahlen sind eine Möglichkeit Zahlen mit Nachkommastellen in
einem Computer darzustellen. Die Anzahl der Nachkommastellen ist nicht
fix vorgegeben. Daher der Name <b>Fließ</b>-kommazahlen. C kennt die
folgenden Datentypen für Fließkommazahlen.
</p>

<table cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Bezeichner</th>
<th scope="col" class="left">Größe</th>
<th scope="col" class="left">Wertebereich</th>
<th scope="col" class="left">Genauigkeit</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>float</code></td>
<td class="left">32 Bit</td>
<td class="left">\(\pm3.4*10^{38}\)</td>
<td class="left">ca. 7 Stellen</td>
</tr>

<tr>
<td class="left"><code>double</code></td>
<td class="left">64 Bit</td>
<td class="left">\(\pm2.3*10^{308}\)</td>
<td class="left">ca. 16 Stellen</td>
</tr>

<tr>
<td class="left"><code>long double</code></td>
<td class="left">128 Bit</td>
<td class="left">\(\pm3.4*10^{4932}\)</td>
<td class="left">ca. 19 Stellen</td>
</tr>
</tbody>
</table>

<div class="org-src-container">

<pre class="src src-C++"><span class="org-keyword">auto</span> <span class="org-variable-name">pi</span> = 3.14159265358979323846;
<span class="org-keyword">auto</span> <span class="org-variable-name">tau</span> = 2 * pi;
<span class="org-keyword">auto</span> <span class="org-variable-name">ganz</span> = 3.0; <span class="org-comment-delimiter">// </span><span class="org-comment">Auch 3.0 ist eine Kommazahl (mit .0000 als Kommastellen)</span>
<span class="org-keyword">auto</span> <span class="org-variable-name">ganz2</span> = 4.; <span class="org-comment-delimiter">// </span><span class="org-comment">Ein . ist ausreichend um eine Flie&#223;kommazahl zu erzeugen</span>
<span class="org-keyword">auto</span> <span class="org-variable-name">expo</span> = 3e3; <span class="org-comment-delimiter">// </span><span class="org-comment">Exponentialschreibweise. Entspricht 3*10^3</span>
<span class="org-type">double</span> <span class="org-variable-name">kein_integer</span> = 23; <span class="org-comment-delimiter">// </span><span class="org-comment">Wird automatisch in 23.0 umgewandelt</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Welche Datentypen sollte man verwenden?</h3>
<div class="outline-text-3" id="text-4-3">
<p>
<b>Generell faktisch immer <code>int</code> und <code>double</code></b> 
</p>

<p>
C und C++ unterstützen sehr viele unterschiedliche Datentypen für
Zahlen, aber nur wenige sind ohne spezielle Gründe sinnvoll. Falls Sie
keine SEHR guten Gründe haben, sollten Sie generell <code>int</code> und <code>double</code>
verwenden. Gute Gründe sind fast ausschließlich die Interaktion mit
Hardware welche bestimmte Datentypen benötigen.
</p>

<p>
Das Rechnen mit <code>short</code> und <code>float</code> ist auf PCs <b>nicht generell
schneller</b> als das Rechnen mit <code>int</code> und <code>double</code> und häufig sogar
langsamer.
</p>

<p>
Der Datentyp <code>char</code> stellt eine Ausnahme dar da er zum Speichern von
Zeichen verwendet wird.
</p>
</div>
</div>
