script/mci_cpp_script.tex
\subsection{Ganzzahlen}
\label{sec-4-1}
Ganzzahlen werden verwendet um ganze Zahlen (ohne Kommastellen) zu
speichern. Die unterschiedlichen Datentypen für Ganzzahlen
unterscheiden sich hinsichtlich der Wertebereiche welche in ihnen
gespeichert werden können und wie viel Speicher eine einzelne Zahl
belegt.

Leider ist die Größe dieser Datentypen in C nicht standardisiert (es
ist nur die minimale Größe spezifiziert). Sollte man garantierte
Größen benötigen kann man (seit C99) den Header \verb~stdint.h~ verwenden
(\href{http://openbook.rheinwerk-verlag.de/c_von_a_bis_z/030_c_anhang_b_017.htm}{weitere Info}). Auf einem aktuellen PC mit 64 Bit Architektur sind
folgende Größen üblich. Auf Mikroprozessoren und Embedded Devices
können die Größen stark von dieser Tabelle abweichen.

\begin{center}
\begin{tabular}{lll}
Bezeichner & Übliche Größe auf PC & Üblicher Wertebereich auf PC\\
\hline
\verb~char~ & 8 Bit & -128 \ldots{} 127\\
\verb~unsigned char~ & 8 Bit & 0 \ldots{} 255\\
\verb~short~ & 16 Bit & -32768 \ldots{} 32767\\
\verb~unsiged short~ & 16 Bit & 0 \ldots{} 65536\\
\verb~int~ & 32 Bit & -2147483648 \ldots{} 2147483647\\
\verb~unsigned int~ & 32 Bit & 0 \ldots{} 4294967296\\
\verb~long~ & 32/64 Bit & -9223372036854775808 \ldots{} 9223372036854775807\\
\verb~unsigned long~ & 32/64 Bit & 0 \ldots{} 18446744073709551616\\
\verb~long long~ & 64 Bit & -9223372036854775808 \ldots{} 9223372036854775807\\
\verb~unsigned long long~ & 64 Bit & 0 \ldots{} 18446744073709551616\\
\end{tabular}
\end{center}

Ganzzahlen mit mehr als 64 Bit werden üblicherweise nicht direkt von C
unterstützt (einige Compiler unterstützen noch 128 Bit Ganzzahlen).
Falls man größere Zahlen benötigt muss eine externe Bibliothek, z.B.
\href{https://gmplib.org/}{GMP} , verwendet werden. Mit dieser Bibliothek sind beliebig große
Ganzzahlen möglich.
\subsection{Fließkommazahlen}
\label{sec-4-2}
Fließkommazahlen sind eine Möglichkeit Zahlen mit Nachkommastellen in
einem Computer darzustellen. Die Anzahl der Nachkommastellen ist nicht
fix vorgegeben. Daher der Name \textbf{Fließ}-kommazahlen. C kennt die
folgenden Datentypen für Fließkommazahlen.

\begin{center}
\begin{tabular}{llll}
Bezeichner & Größe & Wertebereich & Genauigkeit\\
\hline
\verb~float~ & 32 Bit & $\pm3.4*10^{38}$ & ca. 7 Stellen\\
\verb~double~ & 64 Bit & $\pm2.3*10^{308}$ & ca. 16 Stellen\\
\verb~long double~ & 128 Bit & $\pm3.4*10^{4932}$ & ca. 19 Stellen\\
\end{tabular}
\end{center}

\begin{minted}[fontsize=\scriptsize,numberblanklines=false]{c++}
auto pi = 3.14159265358979323846;
auto tau = 2 * pi;
auto ganz = 3.0; // Auch 3.0 ist eine Kommazahl (mit .0000 als Kommastellen)
auto ganz2 = 4.; // Ein . ist ausreichend um eine Fließkommazahl zu erzeugen
auto expo = 3e3; // Exponentialschreibweise. Entspricht 3*10^3
double kein_integer = 23; // Wird automatisch in 23.0 umgewandelt
\end{minted}
\subsection{Welche Datentypen sollte man verwenden?}
\label{sec-4-3}
\textbf{Generell faktisch immer \verb~int~ und \verb~double~} 

C und C++ unterstützen sehr viele unterschiedliche Datentypen für
Zahlen, aber nur wenige sind ohne spezielle Gründe sinnvoll. Falls Sie
keine SEHR guten Gründe haben, sollten Sie generell \verb~int~ und \verb~double~
verwenden. Gute Gründe sind fast ausschließlich die Interaktion mit
Hardware welche bestimmte Datentypen benötigen.

Das Rechnen mit \verb~short~ und \verb~float~ ist auf PCs \textbf{nicht generell
schneller} als das Rechnen mit \verb~int~ und \verb~double~ und häufig sogar
langsamer.

Der Datentyp \verb~char~ stellt eine Ausnahme dar da er zum Speichern von
Zeichen verwendet wird.
