script/mci_cpp_script.org
** Boolsche Werte
Wie auch in C werden Wahrheitswerte (true/false) in C++ durch
Ganzzahlen dargestellt. Die Zahl ~0~ repräsentiert ~false~ und alle
anderen Zahlen (positiv wie auch negativ) repräsentieren ~true~.

#+BEGIN_SRC C
  if(0) printf("true"); else printf("false");     // false
  if(-0) printf("true"); else printf("false");    // false
  if(23-23) printf("true"); else printf("false"); // false
  if(42) printf("true"); else printf("false");    // true
  if(-255) printf("true"); else printf("false");  // true

  int a = 0;
  int b = 47;
  if(a) printf("true"); else printf("false");  // false
  if(b) printf("true"); else printf("false");  // true
#+END_SRC

In C++ gibt es allerdings einen eigenen Datetyp zur Speicherung von
Wahrheitswerten namens ~bool~. Intern wird immer noch eine Ganzzahl
gespeichert (die Größe ist nicht spezifiziert, aber häufig 1 Byte),
aber die Verwendung von ~bool~ hat einige Vorteile:

1) Die Verwendung von ~bool~ macht klar, dass die Variable, der
   Parameter, der Rückgabewert nur Wahrheitswerte berücksichtigt. Bei
   Verwendung von z.B. ~int~ ist das häufig nicht offensichtlich.
2) Es gibt die Bezeichner ~true~ und ~false~ mit denen verglichen
   werden kann und die als Rückgabewert verwendet werden können, was
   den Code ebenfalls lesbarer macht.
3) Der Datentyp ~bool~ garantiert, dass intern nur ~0~ oder ~1~
   gespeichert wird, selbst wenn andere Zahlen zugewiesen werden (was
   gültig ist)

In C ist etwas sehr ähnliches durch das Einbinden der Headerdatei
~stdbool.h~ verfügbar ([[http://openbook.rheinwerk-verlag.de/c_von_a_bis_z/005_c_basisdatentypen_015.htm][Info]]). In C++ ist ~bool~ allerdings fixer
Bestandteil der Sprache selbst.

*** Beispiel 1
Wir sehen uns die Verwendung von ~bool~ als Rückgabewert einer
Funktion an die zurück gibt ob ein Integer gerade ist oder nicht.
#+BEGIN_SRC C++
  #include <iostream>
  using namespace std;

  bool ist_gerade(int zahl) {
    if (zahl % 2 == 0)
      return true;
    else
      return false;
  }

  int main() {
    int a = 23;
    if (ist_gerade(a)) // bool kann direkt als Bedingung verwendet werden
      cout << a << " ist gerade" << endl;
    else
      cout << a << " ist nicht gerade" << endl;
    // Ausgabe:
    // 23 ist nicht gerade

    int b = 42;
    bool ist_b_gerade =
        ist_gerade(b); // Wir können bool in einer Variable speichern
    if (b == true)     // Wir können explizit mit == vergleichen
      cout << b << " ist gerade" << endl;
    else
      cout << b << " ist nicht gerade" << endl;
    // Ausgabe:
    // 42 ist nicht gerade
  }
#+END_SRC

*** Beispiel 2
Verwendung von ~bool~ als Parameter
#+BEGIN_SRC C++
  #include <iostream>
  using namespace std;

  void print(int zahl, bool mit_text) {
    if (mit_text)
      cout << "Zahl ist " << zahl << endl;
    else
      cout << zahl << endl;
  }

  int main() {
    int i = 42;
    print(i, false);
    print(i, true);
  }

  // Ausgabe:
  // 42
  // Zahl ist 42
#+END_SRC

