script/mci_cpp_script.html
<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Boolsche Werte</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Wie auch in C werden Wahrheitswerte (true/false) in C++ durch
Ganzzahlen dargestellt. Die Zahl <code>0</code> repräsentiert <code>false</code> und alle
anderen Zahlen (positiv wie auch negativ) repräsentieren <code>true</code>.
</p>

<div class="org-src-container">

<pre class="src src-C"><span class="org-keyword">if</span>(0) printf(<span class="org-string">"true"</span>); <span class="org-keyword">else</span> printf(<span class="org-string">"false"</span>);     <span class="org-comment-delimiter">// </span><span class="org-comment">false</span>
<span class="org-keyword">if</span>(-0) printf(<span class="org-string">"true"</span>); <span class="org-keyword">else</span> printf(<span class="org-string">"false"</span>);    <span class="org-comment-delimiter">// </span><span class="org-comment">false</span>
<span class="org-keyword">if</span>(23-23) printf(<span class="org-string">"true"</span>); <span class="org-keyword">else</span> printf(<span class="org-string">"false"</span>); <span class="org-comment-delimiter">// </span><span class="org-comment">false</span>
<span class="org-keyword">if</span>(42) printf(<span class="org-string">"true"</span>); <span class="org-keyword">else</span> printf(<span class="org-string">"false"</span>);    <span class="org-comment-delimiter">// </span><span class="org-comment">true</span>
<span class="org-keyword">if</span>(-255) printf(<span class="org-string">"true"</span>); <span class="org-keyword">else</span> printf(<span class="org-string">"false"</span>);  <span class="org-comment-delimiter">// </span><span class="org-comment">true</span>

<span class="org-type">int</span> <span class="org-variable-name">a</span> = 0;
<span class="org-type">int</span> <span class="org-variable-name">b</span> = 47;
<span class="org-keyword">if</span>(a) printf(<span class="org-string">"true"</span>); <span class="org-keyword">else</span> printf(<span class="org-string">"false"</span>);  <span class="org-comment-delimiter">// </span><span class="org-comment">false</span>
<span class="org-keyword">if</span>(b) printf(<span class="org-string">"true"</span>); <span class="org-keyword">else</span> printf(<span class="org-string">"false"</span>);  <span class="org-comment-delimiter">// </span><span class="org-comment">true</span>
</pre>
</div>

<p>
In C++ gibt es allerdings einen eigenen Datetyp zur Speicherung von
Wahrheitswerten namens <code>bool</code>. Intern wird immer noch eine Ganzzahl
gespeichert (die Größe ist nicht spezifiziert, aber häufig 1 Byte),
aber die Verwendung von <code>bool</code> hat einige Vorteile:
</p>

<ol class="org-ol">
<li>Die Verwendung von <code>bool</code> macht klar, dass die Variable, der
Parameter, der Rückgabewert nur Wahrheitswerte berücksichtigt. Bei
Verwendung von z.B. <code>int</code> ist das häufig nicht offensichtlich.
</li>
<li>Es gibt die Bezeichner <code>true</code> und <code>false</code> mit denen verglichen
werden kann und die als Rückgabewert verwendet werden können, was
den Code ebenfalls lesbarer macht.
</li>
<li>Der Datentyp <code>bool</code> garantiert, dass intern nur <code>0</code> oder <code>1</code>
gespeichert wird, selbst wenn andere Zahlen zugewiesen werden (was
gültig ist)
</li>
</ol>

<p>
In C ist etwas sehr ähnliches durch das Einbinden der Headerdatei
<code>stdbool.h</code> verfügbar (<a href="http://openbook.rheinwerk-verlag.de/c_von_a_bis_z/005_c_basisdatentypen_015.htm">Info</a>). In C++ ist <code>bool</code> allerdings fixer
Bestandteil der Sprache selbst.
</p>
</div>

<div id="outline-container-sec-4-4-1" class="outline-4">
<h4 id="sec-4-4-1"><span class="section-number-4">4.4.1</span> Beispiel 1</h4>
<div class="outline-text-4" id="text-4-4-1">
<p>
Wir sehen uns die Verwendung von <code>bool</code> als Rückgabewert einer
Funktion an die zurück gibt ob ein Integer gerade ist oder nicht.
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;iostream&gt;</span>
<span class="org-keyword">using</span> <span class="org-keyword">namespace</span> <span class="org-constant">std</span>;

<span class="org-type">bool</span> <span class="org-function-name">ist_gerade</span>(<span class="org-type">int</span> <span class="org-variable-name">zahl</span>) {
  <span class="org-keyword">if</span> (zahl % 2 == 0)
    <span class="org-keyword">return</span> <span class="org-constant">true</span>;
  <span class="org-keyword">else</span>
    <span class="org-keyword">return</span> <span class="org-constant">false</span>;
}

<span class="org-type">int</span> <span class="org-function-name">main</span>() {
  <span class="org-type">int</span> <span class="org-variable-name">a</span> = 23;
  <span class="org-keyword">if</span> (ist_gerade(a)) <span class="org-comment-delimiter">// </span><span class="org-comment">bool kann direkt als Bedingung verwendet werden</span>
    cout &lt;&lt; a &lt;&lt; <span class="org-string">" ist gerade"</span> &lt;&lt; endl;
  <span class="org-keyword">else</span>
    cout &lt;&lt; a &lt;&lt; <span class="org-string">" ist nicht gerade"</span> &lt;&lt; endl;
  <span class="org-comment-delimiter">// </span><span class="org-comment">Ausgabe:</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">23 ist nicht gerade</span>

  <span class="org-type">int</span> <span class="org-variable-name">b</span> = 42;
  <span class="org-type">bool</span> <span class="org-variable-name">ist_b_gerade</span> =
      ist_gerade(b); <span class="org-comment-delimiter">// </span><span class="org-comment">Wir k&#246;nnen bool in einer Variable speichern</span>
  <span class="org-keyword">if</span> (b == <span class="org-constant">true</span>)     <span class="org-comment-delimiter">// </span><span class="org-comment">Wir k&#246;nnen explizit mit == vergleichen</span>
    cout &lt;&lt; b &lt;&lt; <span class="org-string">" ist gerade"</span> &lt;&lt; endl;
  <span class="org-keyword">else</span>
    cout &lt;&lt; b &lt;&lt; <span class="org-string">" ist nicht gerade"</span> &lt;&lt; endl;
  <span class="org-comment-delimiter">// </span><span class="org-comment">Ausgabe:</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">42 ist nicht gerade</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-4-2" class="outline-4">
<h4 id="sec-4-4-2"><span class="section-number-4">4.4.2</span> Beispiel 2</h4>
<div class="outline-text-4" id="text-4-4-2">
<p>
Verwendung von <code>bool</code> als Parameter
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;iostream&gt;</span>
<span class="org-keyword">using</span> <span class="org-keyword">namespace</span> <span class="org-constant">std</span>;

<span class="org-type">void</span> <span class="org-function-name">print</span>(<span class="org-type">int</span> <span class="org-variable-name">zahl</span>, <span class="org-type">bool</span> <span class="org-variable-name">mit_text</span>) {
  <span class="org-keyword">if</span> (mit_text)
    cout &lt;&lt; <span class="org-string">"Zahl ist "</span> &lt;&lt; zahl &lt;&lt; endl;
  <span class="org-keyword">else</span>
    cout &lt;&lt; zahl &lt;&lt; endl;
}

<span class="org-type">int</span> <span class="org-function-name">main</span>() {
  <span class="org-type">int</span> <span class="org-variable-name">i</span> = 42;
  print(i, <span class="org-constant">false</span>);
  print(i, <span class="org-constant">true</span>);
}

<span class="org-comment-delimiter">// </span><span class="org-comment">Ausgabe:</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">42</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">Zahl ist 42</span>
</pre>
</div>
</div>
</div>
