script/mci_cpp_script.org
*** Beispiel 3
Wir sehen, dass eine Variable vom Typ ~bool~ mit ~cout~ als Zahl (~0~
oder ~1~) ausgegeben wird und dass ~bool~ nur ~0~ oder ~1~ speichert,
selbst wenn eine andere Zahl zugewiesen wird.
#+BEGIN_SRC C++
  #include <iostream>
  using namespace std;

  int main() {
    bool b1 = true;
    bool b2 = false;

    cout << "b1 = " << b1 << ", b2 = " << b2 << endl;
    // Ausgabe:
    // b1 = 1, b2 = 0

    bool b3 = 500;
    cout << "b3 = " << b3 << endl;
    // Ausgabe:
    // b3 = 1

    cout << "false = " << false << endl;
    cout << "true = " << true << endl;
    // Ausgabe:
    // false = 0
    // true = 1
  }
#+END_SRC
** auto
Seit C++11 unterstützt C++ eine einfache Form der sogenannten
[[https://de.wikipedia.org/wiki/Typinferenz][Typinferenz]]. Das bedeutet, dass wir den Datentyp einer Variable nicht
explizit angeben müssen, wenn der Compiler einen eindeutigen Typ
automatisch bestimmen kann. Der Compiler wird angewiesen den Datentyp
selbst zu bestimmen indem das Schlüsselwort ~auto~ statt des Datentyps
verwendet wird.

Das Schlüsselwort ~auto~ ändert nichts an der Tatsache, dass C++ den
Datentyp einer Variable bereits beim Compilieren eindeutig wissen muss
und dass sich dieser Datentyp während der Ausführung auch nicht ändern
kann!
*** Vorteile
- Man kann sich teilweise das Schreiben langer Datentypen sparen. Dies
  ist insbesondere hilfreich wenn man Templateparameter verwendet, da
  die Typnamen dadurch sehr lange werden können. Templates und
  Templateparameter werden später noch besprochen.
- Falls man den Datentyp an einer Stelle im Code ändert, ändern sich
  automatisch alle davon betroffenen Variablen mit ~auto~ automatisch.
  Ohne ~auto~ muss man möglicherweise an vielen Stellen im Code die
  Datentypen manuell anpassen. Siehe späteres Beispiel.
*** Nachteile
- Der Code kann durch Verwendung vieler Variablen mit ~auto~
  unleserlich werden, da man nicht mehr auf einen Blick sieht was in
  einer Variable gespeichert ist.
- Falls bei einer Variable klar ist, dass sie für das korrekte
  Funktionieren des Codes einen bestimmten Datentyp haben muss (z.B.
  ~int~ für einen Index eines Arrays) kann es ungünstig sein für diese
  Variable ~auto~ zu verwenden, da es schwieriger wird Fehler zu
  finden.
*** Beispiel 1
Ein paar Beispiele von ~auto~ bei Zuweisungen
#+BEGIN_SRC C++
  auto a = 23;       // a ist int
  auto b = 42.0;     // b ist double
  auto c = 'A';      // c ist char
  auto d = 23 / 7;   // d ist int
  auto e = 23 / 3.4; // e ist double
#+END_SRC
*** Beispiel 2
Hier ein Beispiel wie ~auto~ nicht verwendet werden kann:
#+BEGIN_SRC C++
  auto i;
  i = 20;
  // Gibt einen Compilerfehler
#+END_SRC
Prinzipiell könnte der Compiler herausfinden, dass an ~i~ nach der
Deklaration ein ~int~ zugewiesen wird und deshalb ~i~ ein ~int~ sein
muss. Die Typinferenz in C++ ist aber nicht mächtig genug um das
aufzulösen. ~auto~ funktioniert nur, falls in der gleichen Zeile etwas
zugewiesen wird.
