script/mci_cpp_script.html

<div id="outline-container-sec-4-4-3" class="outline-4">
<h4 id="sec-4-4-3"><span class="section-number-4">4.4.3</span> Beispiel 3</h4>
<div class="outline-text-4" id="text-4-4-3">
<p>
Wir sehen, dass eine Variable vom Typ <code>bool</code> mit <code>cout</code> als Zahl (<code>0</code>
oder <code>1</code>) ausgegeben wird und dass <code>bool</code> nur <code>0</code> oder <code>1</code> speichert,
selbst wenn eine andere Zahl zugewiesen wird.
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;iostream&gt;</span>
<span class="org-keyword">using</span> <span class="org-keyword">namespace</span> <span class="org-constant">std</span>;

<span class="org-type">int</span> <span class="org-function-name">main</span>() {
  <span class="org-type">bool</span> <span class="org-variable-name">b1</span> = <span class="org-constant">true</span>;
  <span class="org-type">bool</span> <span class="org-variable-name">b2</span> = <span class="org-constant">false</span>;

  cout &lt;&lt; <span class="org-string">"b1 = "</span> &lt;&lt; b1 &lt;&lt; <span class="org-string">", b2 = "</span> &lt;&lt; b2 &lt;&lt; endl;
  <span class="org-comment-delimiter">// </span><span class="org-comment">Ausgabe:</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">b1 = 1, b2 = 0</span>

  <span class="org-type">bool</span> <span class="org-variable-name">b3</span> = 500;
  cout &lt;&lt; <span class="org-string">"b3 = "</span> &lt;&lt; b3 &lt;&lt; endl;
  <span class="org-comment-delimiter">// </span><span class="org-comment">Ausgabe:</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">b3 = 1</span>

  cout &lt;&lt; <span class="org-string">"false = "</span> &lt;&lt; <span class="org-constant">false</span> &lt;&lt; endl;
  cout &lt;&lt; <span class="org-string">"true = "</span> &lt;&lt; <span class="org-constant">true</span> &lt;&lt; endl;
  <span class="org-comment-delimiter">// </span><span class="org-comment">Ausgabe:</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">false = 0</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">true = 1</span>
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> <code>auto</code></h3>
<div class="outline-text-3" id="text-4-5">
<p>
Seit C++11 unterstützt C++ eine einfache Form der sogenannten
<a href="https://de.wikipedia.org/wiki/Typinferenz">Typinferenz</a>. Das bedeutet, dass wir den Datentyp einer Variable nicht
explizit angeben müssen, wenn der Compiler einen eindeutigen Typ
automatisch bestimmen kann. Der Compiler wird angewiesen den Datentyp
selbst zu bestimmen indem das Schlüsselwort <code>auto</code> statt des Datentyps
verwendet wird.
</p>

<p>
Das Schlüsselwort <code>auto</code> ändert nichts an der Tatsache, dass C++ den
Datentyp einer Variable bereits beim Compilieren eindeutig wissen muss
und dass sich dieser Datentyp während der Ausführung auch nicht ändern
kann!
</p>
</div>
<div id="outline-container-sec-4-5-1" class="outline-4">
<h4 id="sec-4-5-1"><span class="section-number-4">4.5.1</span> Vorteile</h4>
<div class="outline-text-4" id="text-4-5-1">
<ul class="org-ul">
<li>Man kann sich teilweise das Schreiben langer Datentypen sparen. Dies
ist insbesondere hilfreich wenn man Templateparameter verwendet, da
die Typnamen dadurch sehr lange werden können. Templates und
Templateparameter werden später noch besprochen.
</li>
<li>Falls man den Datentyp an einer Stelle im Code ändert, ändern sich
automatisch alle davon betroffenen Variablen mit <code>auto</code> automatisch.
Ohne <code>auto</code> muss man möglicherweise an vielen Stellen im Code die
Datentypen manuell anpassen. Siehe späteres Beispiel.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-5-2" class="outline-4">
<h4 id="sec-4-5-2"><span class="section-number-4">4.5.2</span> Nachteile</h4>
<div class="outline-text-4" id="text-4-5-2">
<ul class="org-ul">
<li>Der Code kann durch Verwendung vieler Variablen mit <code>auto</code>
unleserlich werden, da man nicht mehr auf einen Blick sieht was in
einer Variable gespeichert ist.
</li>
<li>Falls bei einer Variable klar ist, dass sie für das korrekte
Funktionieren des Codes einen bestimmten Datentyp haben muss (z.B.
<code>int</code> für einen Index eines Arrays) kann es ungünstig sein für diese
Variable <code>auto</code> zu verwenden, da es schwieriger wird Fehler zu
finden.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-5-3" class="outline-4">
<h4 id="sec-4-5-3"><span class="section-number-4">4.5.3</span> Beispiel 1</h4>
<div class="outline-text-4" id="text-4-5-3">
<p>
Ein paar Beispiele von <code>auto</code> bei Zuweisungen
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-keyword">auto</span> <span class="org-variable-name">a</span> = 23;       <span class="org-comment-delimiter">// </span><span class="org-comment">a ist int</span>
<span class="org-keyword">auto</span> <span class="org-variable-name">b</span> = 42.0;     <span class="org-comment-delimiter">// </span><span class="org-comment">b ist double</span>
<span class="org-keyword">auto</span> <span class="org-variable-name">c</span> = <span class="org-string">'A'</span>;      <span class="org-comment-delimiter">// </span><span class="org-comment">c ist char</span>
<span class="org-keyword">auto</span> <span class="org-variable-name">d</span> = 23 / 7;   <span class="org-comment-delimiter">// </span><span class="org-comment">d ist int</span>
<span class="org-keyword">auto</span> <span class="org-variable-name">e</span> = 23 / 3.4; <span class="org-comment-delimiter">// </span><span class="org-comment">e ist double</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-5-4" class="outline-4">
<h4 id="sec-4-5-4"><span class="section-number-4">4.5.4</span> Beispiel 2</h4>
<div class="outline-text-4" id="text-4-5-4">
<p>
Hier ein Beispiel wie <code>auto</code> nicht verwendet werden kann:
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-keyword">auto</span> <span class="org-variable-name">i</span>;
i = 20;
<span class="org-comment-delimiter">// </span><span class="org-comment">Gibt einen Compilerfehler</span>
</pre>
</div>
<p>
Prinzipiell könnte der Compiler herausfinden, dass an <code>i</code> nach der
Deklaration ein <code>int</code> zugewiesen wird und deshalb <code>i</code> ein <code>int</code> sein
muss. Die Typinferenz in C++ ist aber nicht mächtig genug um das
aufzulösen. <code>auto</code> funktioniert nur, falls in der gleichen Zeile etwas
zugewiesen wird.
</p>
</div>
</div>
