script/mci_cpp_script.tex

\subsubsection{Beispiel 3}
\label{sec-4-4-3}
Wir sehen, dass eine Variable vom Typ \verb~bool~ mit \verb~cout~ als Zahl (\verb~0~
oder \verb~1~) ausgegeben wird und dass \verb~bool~ nur \verb~0~ oder \verb~1~ speichert,
selbst wenn eine andere Zahl zugewiesen wird.
\begin{minted}[fontsize=\scriptsize,numberblanklines=false]{c++}
#include <iostream>
using namespace std;

int main() {
  bool b1 = true;
  bool b2 = false;

  cout << "b1 = " << b1 << ", b2 = " << b2 << endl;
  // Ausgabe:
  // b1 = 1, b2 = 0

  bool b3 = 500;
  cout << "b3 = " << b3 << endl;
  // Ausgabe:
  // b3 = 1

  cout << "false = " << false << endl;
  cout << "true = " << true << endl;
  // Ausgabe:
  // false = 0
  // true = 1
}
\end{minted}
\subsection{auto}
\label{sec-4-5}
Seit C++11 unterstützt C++ eine einfache Form der sogenannten
\href{https://de.wikipedia.org/wiki/Typinferenz}{Typinferenz}. Das bedeutet, dass wir den Datentyp einer Variable nicht
explizit angeben müssen, wenn der Compiler einen eindeutigen Typ
automatisch bestimmen kann. Der Compiler wird angewiesen den Datentyp
selbst zu bestimmen indem das Schlüsselwort \verb~auto~ statt des Datentyps
verwendet wird.

Das Schlüsselwort \verb~auto~ ändert nichts an der Tatsache, dass C++ den
Datentyp einer Variable bereits beim Compilieren eindeutig wissen muss
und dass sich dieser Datentyp während der Ausführung auch nicht ändern
kann!
\subsubsection{Vorteile}
\label{sec-4-5-1}
\begin{itemize}
\item Man kann sich teilweise das Schreiben langer Datentypen sparen. Dies
ist insbesondere hilfreich wenn man Templateparameter verwendet, da
die Typnamen dadurch sehr lange werden können. Templates und
Templateparameter werden später noch besprochen.
\item Falls man den Datentyp an einer Stelle im Code ändert, ändern sich
automatisch alle davon betroffenen Variablen mit \verb~auto~ automatisch.
Ohne \verb~auto~ muss man möglicherweise an vielen Stellen im Code die
Datentypen manuell anpassen. Siehe späteres Beispiel.
\end{itemize}
\subsubsection{Nachteile}
\label{sec-4-5-2}
\begin{itemize}
\item Der Code kann durch Verwendung vieler Variablen mit \verb~auto~
unleserlich werden, da man nicht mehr auf einen Blick sieht was in
einer Variable gespeichert ist.
\item Falls bei einer Variable klar ist, dass sie für das korrekte
Funktionieren des Codes einen bestimmten Datentyp haben muss (z.B.
\verb~int~ für einen Index eines Arrays) kann es ungünstig sein für diese
Variable \verb~auto~ zu verwenden, da es schwieriger wird Fehler zu
finden.
\end{itemize}
\subsubsection{Beispiel 1}
\label{sec-4-5-3}
Ein paar Beispiele von \verb~auto~ bei Zuweisungen
\begin{minted}[fontsize=\scriptsize,numberblanklines=false]{c++}
auto a = 23;       // a ist int
auto b = 42.0;     // b ist double
auto c = 'A';      // c ist char
auto d = 23 / 7;   // d ist int
auto e = 23 / 3.4; // e ist double
\end{minted}
\subsubsection{Beispiel 2}
\label{sec-4-5-4}
Hier ein Beispiel wie \verb~auto~ nicht verwendet werden kann:
\begin{minted}[fontsize=\scriptsize,numberblanklines=false]{c++}
auto i;
i = 20;
// Gibt einen Compilerfehler
\end{minted}
Prinzipiell könnte der Compiler herausfinden, dass an \verb~i~ nach der
Deklaration ein \verb~int~ zugewiesen wird und deshalb \verb~i~ ein \verb~int~ sein
muss. Die Typinferenz in C++ ist aber nicht mächtig genug um das
aufzulösen. \verb~auto~ funktioniert nur, falls in der gleichen Zeile etwas
zugewiesen wird.
