script/mci_cpp_script.org
*** Beispiel 3
Ein großer Vorteil von ~auto~ ist, dass sich definierte Typen
automatisch durch ein ganzes Programm durchziehen, ohne dass der
Datentyp an jeder Stelle geändert werden muss. Angenommen wir haben
den folgenden Code mit einem ~int~ als Anfangsdatentyp geschrieben:
#+BEGIN_SRC C++
  #include <iostream>
  using namespace std;

  int main() {
    int start = 23;
    int division = start / 3;
    int addition = division + 4;
    int ergebnis = division * addition;
    cout << "Ergebnis = " << ergebnis << endl;
  }
  // Ausgabe:
  // Ergebnis = 77
#+END_SRC
Wollen wir nun alle Berechnungen mit ~double~ durchführen, so müssen
wir alle daran beteiligten Datentypen ändern. Bei diesem einfachen
Beispiel ist das kein großes Problem, aber wenn sich die ganzen Werte
über ein größeres Programm verteilen, kann es schwierig werden alle
Variablen zu finden und korrekt zu ändern.
#+BEGIN_SRC C++
  #include <iostream>
  using namespace std;

  int main() {
    double start = 23;
    double division = start / 3;
    double addition = division + 4;
    double ergebnis = division * addition;
    cout << "Ergebnis = " << ergebnis << endl;
  }
  // Ausgabe:
  // Ergebnis = 89.4444
#+END_SRC
Wenn wir statt eines konkreten Typs ~auto~ verwenden, müssen wir nur
den Typ des Anfangswerts ~start~ ändern und alle anderen Typen
ändern sich automatisch mit.
#+BEGIN_SRC C++
  #include <iostream>
  using namespace std;

  int main() {
    auto start = 23;      // start ist int
    // auto start = 23.0; // start ist double
    auto division = start / 3;
    auto addition = division + 4;
    auto ergebnis = division * addition;
    cout << "Ergebnis = " << ergebnis << endl;
  }
  // Ausgabe bei start = 23:
  // Ergebnis = 77
  // Ausgabe bei start = 23.0:
  // Ergebnis = 89.4444
#+END_SRC
*** COMMENT Beispiel 3
Ein Beispiel für die Verwendung von ~auto~ als Rückgabetyp einer
Funktion (Seit C++14)
#+BEGIN_SRC C++ :flags -std=c++14
  #include <iostream>
  using namespace std;

  auto square(int a) { return a * a; }

  int main() {
      auto result = square(23);
      cout << result << endl;
  }
#+END_SRC

** Strings
