script/mci_cpp_script.html
<div id="outline-container-sec-4-5-5" class="outline-4">
<h4 id="sec-4-5-5"><span class="section-number-4">4.5.5</span> Beispiel 3</h4>
<div class="outline-text-4" id="text-4-5-5">
<p>
Ein großer Vorteil von <code>auto</code> ist, dass sich definierte Typen
automatisch durch ein ganzes Programm durchziehen, ohne dass der
Datentyp an jeder Stelle geändert werden muss. Angenommen wir haben
den folgenden Code mit einem <code>int</code> als Anfangsdatentyp geschrieben:
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;iostream&gt;</span>
<span class="org-keyword">using</span> <span class="org-keyword">namespace</span> <span class="org-constant">std</span>;

<span class="org-type">int</span> <span class="org-function-name">main</span>() {
  <span class="org-type">int</span> <span class="org-variable-name">start</span> = 23;
  <span class="org-type">int</span> <span class="org-variable-name">division</span> = start / 3;
  <span class="org-type">int</span> <span class="org-variable-name">addition</span> = division + 4;
  <span class="org-type">int</span> <span class="org-variable-name">ergebnis</span> = division * addition;
  cout &lt;&lt; <span class="org-string">"Ergebnis = "</span> &lt;&lt; ergebnis &lt;&lt; endl;
}
<span class="org-comment-delimiter">// </span><span class="org-comment">Ausgabe:</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">Ergebnis = 77</span>
</pre>
</div>
<p>
Wollen wir nun alle Berechnungen mit <code>double</code> durchführen, so müssen
wir alle daran beteiligten Datentypen ändern. Bei diesem einfachen
Beispiel ist das kein großes Problem, aber wenn sich die ganzen Werte
über ein größeres Programm verteilen, kann es schwierig werden alle
Variablen zu finden und korrekt zu ändern.
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;iostream&gt;</span>
<span class="org-keyword">using</span> <span class="org-keyword">namespace</span> <span class="org-constant">std</span>;

<span class="org-type">int</span> <span class="org-function-name">main</span>() {
  <span class="org-type">double</span> <span class="org-variable-name">start</span> = 23;
  <span class="org-type">double</span> <span class="org-variable-name">division</span> = start / 3;
  <span class="org-type">double</span> <span class="org-variable-name">addition</span> = division + 4;
  <span class="org-type">double</span> <span class="org-variable-name">ergebnis</span> = division * addition;
  cout &lt;&lt; <span class="org-string">"Ergebnis = "</span> &lt;&lt; ergebnis &lt;&lt; endl;
}
<span class="org-comment-delimiter">// </span><span class="org-comment">Ausgabe:</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">Ergebnis = 89.4444</span>
</pre>
</div>
<p>
Wenn wir statt eines konkreten Typs <code>auto</code> verwenden, müssen wir nur
den Typ des Anfangswerts <code>start</code> ändern und alle anderen Typen
ändern sich automatisch mit.
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;iostream&gt;</span>
<span class="org-keyword">using</span> <span class="org-keyword">namespace</span> <span class="org-constant">std</span>;

<span class="org-type">int</span> <span class="org-function-name">main</span>() {
  <span class="org-keyword">auto</span> <span class="org-variable-name">start</span> = 23;      <span class="org-comment-delimiter">// </span><span class="org-comment">start ist int</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">auto start = 23.0; // start ist double</span>
  <span class="org-keyword">auto</span> <span class="org-variable-name">division</span> = start / 3;
  <span class="org-keyword">auto</span> <span class="org-variable-name">addition</span> = division + 4;
  <span class="org-keyword">auto</span> <span class="org-variable-name">ergebnis</span> = division * addition;
  cout &lt;&lt; <span class="org-string">"Ergebnis = "</span> &lt;&lt; ergebnis &lt;&lt; endl;
}
<span class="org-comment-delimiter">// </span><span class="org-comment">Ausgabe bei start = 23:</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">Ergebnis = 77</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">Ausgabe bei start = 23.0:</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">Ergebnis = 89.4444</span>
</pre>
</div>
</div>
</div>
</div>
