script/mci_cpp_script.tex
\subsubsection{Beispiel 3}
\label{sec-4-5-5}
Ein großer Vorteil von \verb~auto~ ist, dass sich definierte Typen
automatisch durch ein ganzes Programm durchziehen, ohne dass der
Datentyp an jeder Stelle geändert werden muss. Angenommen wir haben
den folgenden Code mit einem \verb~int~ als Anfangsdatentyp geschrieben:
\begin{minted}[fontsize=\scriptsize,numberblanklines=false]{c++}
#include <iostream>
using namespace std;

int main() {
  int start = 23;
  int division = start / 3;
  int addition = division + 4;
  int ergebnis = division * addition;
  cout << "Ergebnis = " << ergebnis << endl;
}
// Ausgabe:
// Ergebnis = 77
\end{minted}
Wollen wir nun alle Berechnungen mit \verb~double~ durchführen, so müssen
wir alle daran beteiligten Datentypen ändern. Bei diesem einfachen
Beispiel ist das kein großes Problem, aber wenn sich die ganzen Werte
über ein größeres Programm verteilen, kann es schwierig werden alle
Variablen zu finden und korrekt zu ändern.
\begin{minted}[fontsize=\scriptsize,numberblanklines=false]{c++}
#include <iostream>
using namespace std;

int main() {
  double start = 23;
  double division = start / 3;
  double addition = division + 4;
  double ergebnis = division * addition;
  cout << "Ergebnis = " << ergebnis << endl;
}
// Ausgabe:
// Ergebnis = 89.4444
\end{minted}
Wenn wir statt eines konkreten Typs \verb~auto~ verwenden, müssen wir nur
den Typ des Anfangswerts \verb~start~ ändern und alle anderen Typen
ändern sich automatisch mit.
\begin{minted}[fontsize=\scriptsize,numberblanklines=false]{c++}
#include <iostream>
using namespace std;

int main() {
  auto start = 23;      // start ist int
  // auto start = 23.0; // start ist double
  auto division = start / 3;
  auto addition = division + 4;
  auto ergebnis = division * addition;
  cout << "Ergebnis = " << ergebnis << endl;
}
// Ausgabe bei start = 23:
// Ergebnis = 77
// Ausgabe bei start = 23.0:
// Ergebnis = 89.4444
\end{minted}
