script/mci_cpp_script.org
*** Strings in C
In C sind Strings nichts anderes als Arrays vom Datentyp ~char~. Jeder
Eintrag im Array entspricht also einem Zeichen. Das Ende des Strings
ist erreich, sobald ein Element des Arrays die Zahl ~0~ enthält.
(Achtung: Nicht das Zeichen ~'0'~). Dies bedeutet also, dass die Länge
des Arrays und die Länge des Strings nicht zwingend etwas miteinander
zu tun haben. Z.B. erzeugt der Befehl ~char str[200] = "Hallo";~ einen
String der Länge 5, welcher 6 Plätze des Arrays einnimmt (5 Zeichen
des Strings und die ~0~ für das Ende des Strings). Das Array selbst
ist aber 200 Elemente groß. Im Speicher sieht der String
folgendermaßen aus:
| Index   | 0    | 1    | 2     | 3     | 4     | 5    | 6     | 7     | 8     | ... | 199   |
| Zeichen | ~H~  | ~a~  | ~l~   | ~l~   | ~o~   | ~\0~ | undef | undef | undef | ... | undef |
| Zahl    | ~72~ | ~97~ | ~108~ | ~108~ | ~111~ | ~0~  | undef | undef | undef | ... | undef |

Die Art und Weise wie Strings in C implementiert sind hat einige Nachteile:
- Wir müssen uns selbst darum kümmern, dass ein Array groß genug ist
  um Platz für den String zu haben. Eine Ausnahme ist die Zuweisung
  eines fixen Strings direkt bei der Initialisierung eines Strings
  (z.B. ~char str[] = "Hallo"~). In diesem Fall kann der Compiler
  selbst bestimmen wie groß der String sein muss.
- Falls wir das Array zu klein wählen, bekommen wir keine
  Fehlermeldung. Das System schreibt einfach über das reservierte
  Array hinaus und überschreibt möglicherweise wichtige
  Speicherbereiche unseres Programms
- Falls aus irgend einem Grund die abschließende ~0~ des Strings
  fehlt, so lesen alle Stringfunktionen (z.B. ~printf("%s",str)~
  einfach über das Stringende hinaus bis irgendwo im Speicher eine ~0~
  steht)
Strings verhalten sich in C (weil es einfach Arrays sind) oft nicht so
wie man es erwarten würde. Ein Beispiel: Wir wollen z.B. zwei Strings
~str1~ und ~str2~ aneinanderhängen und in einem String ~str3~
speichern. In C sieht das folgendermaßen aus:
#+BEGIN_SRC C
  #include <stdio.h>
  #include <string.h>

  int main() {
#+END_SRC
Wir müssen uns selbst darum kümmern, dass ~str1~, ~str2~, und ~str3~
groß genug ist. Aus diesem Grund wählt man die Arrays häufig größer
als eigentlich notwendig.
#+BEGIN_SRC C
    char str1[100], str2[100], str3[200];
#+END_SRC
Nach der Initialisierung, können wir einem String in C nichts mehr mit
~=~ zuweisen. str1 = "Hello " funktioniert also nicht! Wir müssen eine
spezielle Funktion namens ~strcpy~ (string copy) verwenden. Diese
Funktion überprüft nicht, ob das Array auch groß genug für den String
ist!
#+BEGIN_SRC C
    strcpy(str1, "Hello ");
    strcpy(str2, "World");    
#+END_SRC
Man könnte meinen, dass man zwei Strings aneinanderhängt indem man
z.B. ~str1 + str2~ schreibt. Das ist in C aber nicht möglich. Um die
Strings aneinanderzuhängen müssen wir zuerst ~str1~ nach ~str3~
kopieren.
#+BEGIN_SRC C
    strcpy(str3, str1);
#+END_SRC
Anschließend können wir die Funktion ~strcat~ (string concatenation)
verwenden um einen zusätzlichen String an ~str3~ anzuhängen. Auch hier
wird nicht überprüft ob ~str3~ groß genug ist um den ganzen String
aufzunehmen!
#+BEGIN_SRC C
    strcat(str3, str2);
    // Ausgabe von str3
    printf("%s", str3);
  }
#+END_SRC
Man sieht also, dass Strings in C relativ kompliziert sind.
