script/mci_cpp_script.html

<div id="outline-container-sec-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> Strings</h3>
<div class="outline-text-3" id="text-4-6">
</div><div id="outline-container-sec-4-6-1" class="outline-4">
<h4 id="sec-4-6-1"><span class="section-number-4">4.6.1</span> Strings in C</h4>
<div class="outline-text-4" id="text-4-6-1">
<p>
In C sind Strings nichts anderes als Arrays vom Datentyp <code>char</code>. Jeder
Eintrag im Array entspricht also einem Zeichen. Das Ende des Strings
ist erreich, sobald ein Element des Arrays die Zahl <code>0</code> enthält.
(Achtung: Nicht das Zeichen ~'0'~). Dies bedeutet also, dass die Länge
des Arrays und die Länge des Strings nicht zwingend etwas miteinander
zu tun haben. Z.B. erzeugt der Befehl <code>char str[200] = "Hallo";</code> einen
String der Länge 5, welcher 6 Plätze des Arrays einnimmt (5 Zeichen
des Strings und die <code>0</code> für das Ende des Strings). Das Array selbst
ist aber 200 Elemente groß. Im Speicher sieht der String
folgendermaßen aus:
</p>
<table cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">Index</td>
<td class="left">0</td>
<td class="left">1</td>
<td class="left">2</td>
<td class="left">3</td>
<td class="left">4</td>
<td class="left">5</td>
<td class="left">6</td>
<td class="left">7</td>
<td class="left">8</td>
<td class="left">&#x2026;</td>
<td class="left">199</td>
</tr>

<tr>
<td class="left">Zeichen</td>
<td class="left"><code>H</code></td>
<td class="left"><code>a</code></td>
<td class="left"><code>l</code></td>
<td class="left"><code>l</code></td>
<td class="left"><code>o</code></td>
<td class="left"><code>\0</code></td>
<td class="left">undef</td>
<td class="left">undef</td>
<td class="left">undef</td>
<td class="left">&#x2026;</td>
<td class="left">undef</td>
</tr>

<tr>
<td class="left">Zahl</td>
<td class="left"><code>72</code></td>
<td class="left"><code>97</code></td>
<td class="left"><code>108</code></td>
<td class="left"><code>108</code></td>
<td class="left"><code>111</code></td>
<td class="left"><code>0</code></td>
<td class="left">undef</td>
<td class="left">undef</td>
<td class="left">undef</td>
<td class="left">&#x2026;</td>
<td class="left">undef</td>
</tr>
</tbody>
</table>

<p>
Die Art und Weise wie Strings in C implementiert sind hat einige Nachteile:
</p>
<ul class="org-ul">
<li>Wir müssen uns selbst darum kümmern, dass ein Array groß genug ist
um Platz für den String zu haben. Eine Ausnahme ist die Zuweisung
eines fixen Strings direkt bei der Initialisierung eines Strings
(z.B. ~char str[] = "Hallo"~). In diesem Fall kann der Compiler
selbst bestimmen wie groß der String sein muss.
</li>
<li>Falls wir das Array zu klein wählen, bekommen wir keine
Fehlermeldung. Das System schreibt einfach über das reservierte
Array hinaus und überschreibt möglicherweise wichtige
Speicherbereiche unseres Programms
</li>
<li>Falls aus irgend einem Grund die abschließende <code>0</code> des Strings
fehlt, so lesen alle Stringfunktionen (z.B. <code>printf("%s",str)</code>
einfach über das Stringende hinaus bis irgendwo im Speicher eine <code>0</code>
steht)
</li>
</ul>
<p>
Strings verhalten sich in C (weil es einfach Arrays sind) oft nicht so
wie man es erwarten würde. Ein Beispiel: Wir wollen z.B. zwei Strings
<code>str1</code> und <code>str2</code> aneinanderhängen und in einem String <code>str3</code>
speichern. In C sieht das folgendermaßen aus:
</p>
<div class="org-src-container">

<pre class="src src-C"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;stdio.h&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;string.h&gt;</span>

<span class="org-type">int</span> <span class="org-function-name">main</span>() {
</pre>
</div>
<p>
Wir müssen uns selbst darum kümmern, dass <code>str1</code>, <code>str2</code>, und <code>str3</code>
groß genug ist. Aus diesem Grund wählt man die Arrays häufig größer
als eigentlich notwendig.
</p>
<div class="org-src-container">

<pre class="src src-C"><span class="org-type">char</span> <span class="org-variable-name">str1</span>[100], <span class="org-variable-name">str2</span>[100], <span class="org-variable-name">str3</span>[200];
</pre>
</div>
<p>
Nach der Initialisierung, können wir einem String in C nichts mehr mit
<code>=</code> zuweisen. <code>str1 = "Hello "~ funktioniert also nicht! Wir müssen
eine spezielle Funktion namens ~strcpy</code> (string copy) verwenden. Diese
Funktion überprüft nicht, ob das Array auch groß genug für den String
ist!
</p>
<div class="org-src-container">

<pre class="src src-C">strcpy(str1, <span class="org-string">"Hello "</span>);
strcpy(str2, <span class="org-string">"World"</span>);
</pre>
</div>
<p>
Man könnte meinen, dass man zwei Strings aneinanderhängt indem man
z.B. <code>str1 + str2</code> schreibt. Das ist in C aber nicht möglich. Um die
Strings aneinanderzuhängen müssen wir zuerst <code>str1</code> nach <code>str3</code>
kopieren.
</p>
<div class="org-src-container">

<pre class="src src-C">strcpy(str3, str1);
</pre>
</div>
<p>
Anschließend können wir die Funktion <code>strcat</code> (string concatenation)
verwenden um einen zusätzlichen String an <code>str3</code> anzuhängen. Auch hier
wird nicht überprüft ob <code>str3</code> groß genug ist um den ganzen String
aufzunehmen!
</p>
<div class="org-src-container">

<pre class="src src-C">  strcat(str3, str2);
  <span class="org-comment-delimiter">// </span><span class="org-comment">Ausgabe von str3</span>
  printf(<span class="org-string">"%s"</span>, str3);
}
</pre>
</div>
<p>
Man sieht also, dass Strings in C relativ kompliziert sind.
</p>
</div>
</div>
