script/mci_cpp_script.tex

\subsection{Strings}
\label{sec-4-6}
\subsubsection{Strings in C}
\label{sec-4-6-1}
In C sind Strings nichts anderes als Arrays vom Datentyp \verb~char~. Jeder
Eintrag im Array entspricht also einem Zeichen. Das Ende des Strings
ist erreich, sobald ein Element des Arrays die Zahl \verb~0~ enthält.
(Achtung: Nicht das Zeichen \textasciitilde{}'0'\textasciitilde{}). Dies bedeutet also, dass die Länge
des Arrays und die Länge des Strings nicht zwingend etwas miteinander
zu tun haben. Z.B. erzeugt der Befehl \verb~char str[200] = "Hallo";~ einen
String der Länge 5, welcher 6 Plätze des Arrays einnimmt (5 Zeichen
des Strings und die \verb~0~ für das Ende des Strings). Das Array selbst
ist aber 200 Elemente groß. Im Speicher sieht der String
folgendermaßen aus:
\begin{center}
\begin{tabular}{llllllllllll}
Index & 0 & 1 & 2 & 3 & 4 & 5 & 6 & 7 & 8 & \ldots{} & 199\\
Zeichen & \verb~H~ & \verb~a~ & \verb~l~ & \verb~l~ & \verb~o~ & \verb~\0~ & undef & undef & undef & \ldots{} & undef\\
Zahl & \verb~72~ & \verb~97~ & \verb~108~ & \verb~108~ & \verb~111~ & \verb~0~ & undef & undef & undef & \ldots{} & undef\\
\end{tabular}
\end{center}

Die Art und Weise wie Strings in C implementiert sind hat einige Nachteile:
\begin{itemize}
\item Wir müssen uns selbst darum kümmern, dass ein Array groß genug ist
um Platz für den String zu haben. Eine Ausnahme ist die Zuweisung
eines fixen Strings direkt bei der Initialisierung eines Strings
(z.B. \textasciitilde{}char str[] = "Hallo"\textasciitilde{}). In diesem Fall kann der Compiler
selbst bestimmen wie groß der String sein muss.
\item Falls wir das Array zu klein wählen, bekommen wir keine
Fehlermeldung. Das System schreibt einfach über das reservierte
Array hinaus und überschreibt möglicherweise wichtige
Speicherbereiche unseres Programms
\item Falls aus irgend einem Grund die abschließende \verb~0~ des Strings
fehlt, so lesen alle Stringfunktionen (z.B. \verb~printf("%s",str)~
einfach über das Stringende hinaus bis irgendwo im Speicher eine \verb~0~
steht)
\end{itemize}
Strings verhalten sich in C (weil es einfach Arrays sind) oft nicht so
wie man es erwarten würde. Ein Beispiel: Wir wollen z.B. zwei Strings
\verb~str1~ und \verb~str2~ aneinanderhängen und in einem String \verb~str3~
speichern. In C sieht das folgendermaßen aus:
\begin{minted}[fontsize=\scriptsize,numberblanklines=false]{c}
#include <stdio.h>
#include <string.h>

int main() {
\end{minted}
Wir müssen uns selbst darum kümmern, dass \verb~str1~, \verb~str2~, und \verb~str3~
groß genug ist. Aus diesem Grund wählt man die Arrays häufig größer
als eigentlich notwendig.
\begin{minted}[fontsize=\scriptsize,numberblanklines=false]{c}
char str1[100], str2[100], str3[200];
\end{minted}
Nach der Initialisierung, können wir einem String in C nichts mehr mit
\verb~=~ zuweisen. str1 = "Hello " funktioniert also nicht! Wir müssen eine
spezielle Funktion namens \verb~strcpy~ (string copy) verwenden. Diese
Funktion überprüft nicht, ob das Array auch groß genug für den String
ist!
\begin{minted}[fontsize=\scriptsize,numberblanklines=false]{c}
strcpy(str1, "Hello ");
strcpy(str2, "World");
\end{minted}
Man könnte meinen, dass man zwei Strings aneinanderhängt indem man
z.B. \verb~str1 + str2~ schreibt. Das ist in C aber nicht möglich. Um die
Strings aneinanderzuhängen müssen wir zuerst \verb~str1~ nach \verb~str3~
kopieren.
\begin{minted}[fontsize=\scriptsize,numberblanklines=false]{c}
strcpy(str3, str1);
\end{minted}
Anschließend können wir die Funktion \verb~strcat~ (string concatenation)
verwenden um einen zusätzlichen String an \verb~str3~ anzuhängen. Auch hier
wird nicht überprüft ob \verb~str3~ groß genug ist um den ganzen String
aufzunehmen!
\begin{minted}[fontsize=\scriptsize,numberblanklines=false]{c}
  strcat(str3, str2);
  // Ausgabe von str3
  printf("%s", str3);
}
\end{minted}
Man sieht also, dass Strings in C relativ kompliziert sind.
