script/mci_cpp_script.org
*** Strings in C++
In C++ gibt es einen eigenen Datentyp für Strings namens
~std::string~. Dieser verhält sich viel mehr wie ein normaler Datentyp
(~int~, ~double~, ...). Um C++ Strings verwenden zu können müssen Sie
diese String Bibliothek mittels ~#include <string>~ einbinden. Das
letzte Beispiel sieht mit Verwendung von C++ Strings folgendermaßen
aus:
#+BEGIN_SRC C++
  #include <iostream>
  #include <string>

  int main() {
    std::string str1, str2, str3; // Platz für beliebig viele Zeichen
    str1 = "Hello ";              // Wir können einfach mit "=" zuweisen
    str2 = "World";
    // Hänge str1 und str2 zusammen und speichere in str3
    str3 = str1 + str2;
    // Gib str3 auf Bildschirm aus
    std::cout << str3;
  }
#+END_SRC
*** Vergleich von C++Strings
In C++ können Strings einfach mittels ~==~ verglichen werden. (In C
funktioniert das nicht, hier muss die Funktion ~strcmp~ verwendet
werden und das Ergebnis auf ~0~ überprüft werden. Noch ungünstiger
ist, dass z.B. ~str1 == str2~ in C eine gültige Anweisung ist, aber
nicht die Strings vergleicht sondern die Adressen an denen ~str1~ und
~str2~ liegen!). In C++ funktionieren auch die Vergleichsoperatoren
~<~, ~>~, ~<=~, ... Sie testen die alphabetische Reihenfolge zweier
Strings.

In C:
#+BEGIN_SRC C
  if (strcmp(str1, str2) == 0) {
    printf("String 1 und 2 sind gleich");
  }
#+END_SRC

In C++:
#+BEGIN_SRC C++
  if (str1 == str2) {
    std::cout << "String 1 und 2 sind gleich";
  }
#+END_SRC
*** Umwandlung von C++String nach C-String
Falls wir aus irgend welchen Gründen einen klassischen C-String aus
einem C++ String erzeugen müssen (z.B. weil wir eine C-Bibliothek
verwenden wollen) erreichen wir das mittels ~.c_str()~. Wollen wir
z.B. einen C-String aus ~str3~ erzeugen, schreiben wir ~str3.c_str()~.
*** Beispiel 1
Wir können C++ Strings wie ganz normale Variablen behandeln und Sie
problemlos als Parameter an eine Funktion schicken, oder sie als
Rückgabewert einer Funktion verwenden. 

Zum Beispiel: Eine Möglichkeit, ~bool~ mit ~cout~ als Text ~true~ und
~false~ auszugeben ist es den Wert mit Hilfe einer Funktion von ~bool~
nach ~string~ zu konvertieren und diesen String dann mittels ~cout~
auszugeben.

#+BEGIN_SRC C++
  #include <iostream>
  #include <string>
  using namespace std; // Verhindert, dass wir überall std:: schreiben müssen

  // Nimmt einen bool Wert entgegen (true, false) und liefert je nach
  // übergebenem Wert des String "true" oder "false" zurück
  string bool_to_string(bool b) {
    if (b == true)
      return "true";
    else
      return "false";
  }

  int main() {
    bool b1 = false;
    bool b2 = true;

    cout << "b1 = " << bool_to_string(b1) << endl;
    cout << "b2 = " << bool_to_string(b2) << endl;
    cout << "false = " << bool_to_string(false) << endl;
    cout << "true = " << bool_to_string(true) << endl;
  }

  // Ausgabe:
  // b1 = false
  // b2 = true
  // false = false
  // true = true
#+END_SRC
