script/mci_cpp_script.html
<div id="outline-container-sec-4-6-2" class="outline-4">
<h4 id="sec-4-6-2"><span class="section-number-4">4.6.2</span> Strings in C++</h4>
<div class="outline-text-4" id="text-4-6-2">
<p>
In C++ gibt es einen eigenen Datentyp für Strings namens
<code>std::string</code>. Dieser verhält sich viel mehr wie ein normaler Datentyp
(<code>int</code>, <code>double</code>, &#x2026;). Um C++ Strings verwenden zu können müssen Sie
diese String Bibliothek mittels <code>#include &lt;string&gt;</code> einbinden. Das
letzte Beispiel sieht mit Verwendung von C++ Strings folgendermaßen
aus:
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;iostream&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;string&gt;</span>

<span class="org-type">int</span> <span class="org-function-name">main</span>() {
  <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">str1</span>, <span class="org-variable-name">str2</span>, <span class="org-variable-name">str3</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">Platz f&#252;r beliebig viele Zeichen</span>
  str1 = <span class="org-string">"Hello "</span>;              <span class="org-comment-delimiter">// </span><span class="org-comment">Wir k&#246;nnen einfach mit "=" zuweisen</span>
  str2 = <span class="org-string">"World"</span>;
  <span class="org-comment-delimiter">// </span><span class="org-comment">H&#228;nge str1 und str2 zusammen und speichere in str3</span>
  str3 = str1 + str2;
  <span class="org-comment-delimiter">// </span><span class="org-comment">Gib str3 auf Bildschirm aus</span>
  <span class="org-constant">std</span>::cout &lt;&lt; str3;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-6-3" class="outline-4">
<h4 id="sec-4-6-3"><span class="section-number-4">4.6.3</span> Vergleich von C++Strings</h4>
<div class="outline-text-4" id="text-4-6-3">
<p>
In C++ können Strings einfach mittels <code>==</code> verglichen werden. (In C
funktioniert das nicht, hier muss die Funktion <code>strcmp</code> verwendet
werden und das Ergebnis auf <code>0</code> überprüft werden. Noch ungünstiger
ist, dass z.B. <code>str1 == str2</code> in C eine gültige Anweisung ist, aber
nicht die Strings vergleicht sondern die Adressen an denen <code>str1</code> und
<code>str2</code> liegen!). In C++ funktionieren auch die Vergleichsoperatoren
<code>&lt;</code>, <code>&gt;</code>, <code>&lt;=</code>, &#x2026; Sie testen die alphabetische Reihenfolge zweier
Strings.
</p>

<p>
In C:
</p>
<div class="org-src-container">

<pre class="src src-C"><span class="org-keyword">if</span> (strcmp(str1, str2) == 0) {
  printf(<span class="org-string">"String 1 und 2 sind gleich"</span>);
}
</pre>
</div>

<p>
In C++:
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-keyword">if</span> (str1 == str2) {
  <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"String 1 und 2 sind gleich"</span>;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-6-4" class="outline-4">
<h4 id="sec-4-6-4"><span class="section-number-4">4.6.4</span> Umwandlung von C++String nach C-String</h4>
<div class="outline-text-4" id="text-4-6-4">
<p>
Falls wir aus irgend welchen Gründen einen klassischen C-String aus
einem C++ String erzeugen müssen (z.B. weil wir eine C-Bibliothek
verwenden wollen) erreichen wir das mittels <code>.c_str()</code>. Wollen wir
z.B. einen C-String aus <code>str3</code> erzeugen, schreiben wir <code>str3.c_str()</code>.
</p>
</div>
</div>
<div id="outline-container-sec-4-6-5" class="outline-4">
<h4 id="sec-4-6-5"><span class="section-number-4">4.6.5</span> Beispiel 1</h4>
<div class="outline-text-4" id="text-4-6-5">
<p>
Wir können C++ Strings wie ganz normale Variablen behandeln und Sie
problemlos als Parameter an eine Funktion schicken, oder sie als
Rückgabewert einer Funktion verwenden. 
</p>

<p>
Zum Beispiel: Eine Möglichkeit, <code>bool</code> mit <code>cout</code> als Text <code>true</code> und
<code>false</code> auszugeben ist es den Wert mit Hilfe einer Funktion von <code>bool</code>
nach <code>string</code> zu konvertieren und diesen String dann mittels <code>cout</code>
auszugeben.
</p>

<div class="org-src-container">

<pre class="src src-C++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;iostream&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;string&gt;</span>
<span class="org-keyword">using</span> <span class="org-keyword">namespace</span> <span class="org-constant">std</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">Verhindert, dass wir &#252;berall std:: schreiben m&#252;ssen</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Nimmt einen bool Wert entgegen (true, false) und liefert je nach</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">&#252;bergebenem Wert des String "true" oder "false" zur&#252;ck</span>
<span class="org-type">string</span> <span class="org-function-name">bool_to_string</span>(<span class="org-type">bool</span> <span class="org-variable-name">b</span>) {
  <span class="org-keyword">if</span> (b == <span class="org-constant">true</span>)
    <span class="org-keyword">return</span> <span class="org-string">"true"</span>;
  <span class="org-keyword">else</span>
    <span class="org-keyword">return</span> <span class="org-string">"false"</span>;
}

<span class="org-type">int</span> <span class="org-function-name">main</span>() {
  <span class="org-type">bool</span> <span class="org-variable-name">b1</span> = <span class="org-constant">false</span>;
  <span class="org-type">bool</span> <span class="org-variable-name">b2</span> = <span class="org-constant">true</span>;

  cout &lt;&lt; <span class="org-string">"b1 = "</span> &lt;&lt; bool_to_string(b1) &lt;&lt; endl;
  cout &lt;&lt; <span class="org-string">"b2 = "</span> &lt;&lt; bool_to_string(b2) &lt;&lt; endl;
  cout &lt;&lt; <span class="org-string">"false = "</span> &lt;&lt; bool_to_string(<span class="org-constant">false</span>) &lt;&lt; endl;
  cout &lt;&lt; <span class="org-string">"true = "</span> &lt;&lt; bool_to_string(<span class="org-constant">true</span>) &lt;&lt; endl;
}

<span class="org-comment-delimiter">// </span><span class="org-comment">Ausgabe:</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">b1 = false</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">b2 = true</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">false = false</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">true = true</span>
</pre>
</div>
</div>
</div>
