script/mci_cpp_script.tex
\subsubsection{Strings in C++}
\label{sec-4-6-2}
In C++ gibt es einen eigenen Datentyp für Strings namens
\verb~std::string~. Dieser verhält sich viel mehr wie ein normaler Datentyp
(\verb~int~, \verb~double~, \ldots{}). Um C++ Strings verwenden zu können müssen Sie
diese String Bibliothek mittels \verb~#include <string>~ einbinden. Das
letzte Beispiel sieht mit Verwendung von C++ Strings folgendermaßen
aus:
\begin{minted}[fontsize=\scriptsize,numberblanklines=false]{c++}
#include <iostream>
#include <string>

int main() {
  std::string str1, str2, str3; // Platz für beliebig viele Zeichen
  str1 = "Hello ";              // Wir können einfach mit "=" zuweisen
  str2 = "World";
  // Hänge str1 und str2 zusammen und speichere in str3
  str3 = str1 + str2;
  // Gib str3 auf Bildschirm aus
  std::cout << str3;
}
\end{minted}
\subsubsection{Vergleich von C++Strings}
\label{sec-4-6-3}
In C++ können Strings einfach mittels \verb~==~ verglichen werden. (In C
funktioniert das nicht, hier muss die Funktion \verb~strcmp~ verwendet
werden und das Ergebnis auf \verb~0~ überprüft werden. Noch ungünstiger
ist, dass z.B. \verb~str1 == str2~ in C eine gültige Anweisung ist, aber
nicht die Strings vergleicht sondern die Adressen an denen \verb~str1~ und
\verb~str2~ liegen!). In C++ funktionieren auch die Vergleichsoperatoren
\verb~<~, \verb~>~, \verb~<=~, \ldots{} Sie testen die alphabetische Reihenfolge zweier
Strings.

In C:
\begin{minted}[fontsize=\scriptsize,numberblanklines=false]{c}
if (strcmp(str1, str2) == 0) {
  printf("String 1 und 2 sind gleich");
}
\end{minted}

In C++:
\begin{minted}[fontsize=\scriptsize,numberblanklines=false]{c++}
if (str1 == str2) {
  std::cout << "String 1 und 2 sind gleich";
}
\end{minted}
\subsubsection{Umwandlung von C++String nach C-String}
\label{sec-4-6-4}
Falls wir aus irgend welchen Gründen einen klassischen C-String aus
einem C++ String erzeugen müssen (z.B. weil wir eine C-Bibliothek
verwenden wollen) erreichen wir das mittels \verb~.c_str()~. Wollen wir
z.B. einen C-String aus \verb~str3~ erzeugen, schreiben wir \verb~str3.c_str()~.
\subsubsection{Beispiel 1}
\label{sec-4-6-5}
Wir können C++ Strings wie ganz normale Variablen behandeln und Sie
problemlos als Parameter an eine Funktion schicken, oder sie als
Rückgabewert einer Funktion verwenden. 

Zum Beispiel: Eine Möglichkeit, \verb~bool~ mit \verb~cout~ als Text \verb~true~ und
\verb~false~ auszugeben ist es den Wert mit Hilfe einer Funktion von \verb~bool~
nach \verb~string~ zu konvertieren und diesen String dann mittels \verb~cout~
auszugeben.

\begin{minted}[fontsize=\scriptsize,numberblanklines=false]{c++}
#include <iostream>
#include <string>
using namespace std; // Verhindert, dass wir überall std:: schreiben müssen

// Nimmt einen bool Wert entgegen (true, false) und liefert je nach
// übergebenem Wert des String "true" oder "false" zurück
string bool_to_string(bool b) {
  if (b == true)
    return "true";
  else
    return "false";
}

int main() {
  bool b1 = false;
  bool b2 = true;

  cout << "b1 = " << bool_to_string(b1) << endl;
  cout << "b2 = " << bool_to_string(b2) << endl;
  cout << "false = " << bool_to_string(false) << endl;
  cout << "true = " << bool_to_string(true) << endl;
}

// Ausgabe:
// b1 = false
// b2 = true
// false = false
// true = true
\end{minted}
