script/mci_cpp_script.org
*** Beispiel 2
Da wir Strings sehr einfach auf Gleichheit überprüfen können und auch
einfach als Parameter einer Funktion übernehmen können, ist es auch
sehr einfach die Strings ~"true"~ und ~"false"~ wieder in einen ~bool~
Wert zu konvertieren.
#+BEGIN_SRC C++
  #include <iostream>
  #include <string>
  using namespace std; // Verhindert, dass wir überall std:: schreiben müssen

  // Nimmt einen String entgegen ("true", "false") und liefert je nach
  // übergebenem String die bool werte true oder false zurück
  bool string_to_bool(string s) {
    if (s == "true")
      return true;
    else
      return false;
  }

  int main() {
    string s1 = "false";
    string s2 = "true";
    // Konvertieren der Strings nach bool
    bool b1 = string_to_bool(s1);
    bool b2 = string_to_bool(s2);

    cout << "b1 = " << b1 << endl;
    cout << "b2 = " << b2 << endl;
    // Das ganze geht natürlich auch ohne zusätzliche Variable
    cout << "false = " << string_to_bool("false") << endl;
    cout << "true = " << string_to_bool("true") << endl;
  }

  // Ausgabe:
  // b1 = 0
  // b2 = 1
  // false = 0
  // true = 1
#+END_SRC

#+RESULTS:

* Ein-/Ausgabe
Um die folgende Funktionalität für die Ein- und Ausgabe verwenden zu
können muss die Headerdatei ~iostream~ mittels ~#include <iostream>~
eingebunden werden.
