script/mci_cpp_script.html
<div id="outline-container-sec-4-6-6" class="outline-4">
<h4 id="sec-4-6-6"><span class="section-number-4">4.6.6</span> Beispiel 2</h4>
<div class="outline-text-4" id="text-4-6-6">
<p>
Da wir Strings sehr einfach auf Gleichheit überprüfen können und auch
einfach als Parameter einer Funktion übernehmen können, ist es auch
sehr einfach die Strings ~"true"~ und ~"false"~ wieder in einen <code>bool</code>
Wert zu konvertieren.
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;iostream&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;string&gt;</span>
<span class="org-keyword">using</span> <span class="org-keyword">namespace</span> <span class="org-constant">std</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">Verhindert, dass wir &#252;berall std:: schreiben m&#252;ssen</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Nimmt einen String entgegen ("true", "false") und liefert je nach</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">&#252;bergebenem String die bool werte true oder false zur&#252;ck</span>
<span class="org-type">bool</span> <span class="org-function-name">string_to_bool</span>(<span class="org-type">string</span> <span class="org-variable-name">s</span>) {
  <span class="org-keyword">if</span> (s == <span class="org-string">"true"</span>)
    <span class="org-keyword">return</span> <span class="org-constant">true</span>;
  <span class="org-keyword">else</span>
    <span class="org-keyword">return</span> <span class="org-constant">false</span>;
}

<span class="org-type">int</span> <span class="org-function-name">main</span>() {
  <span class="org-type">string</span> <span class="org-variable-name">s1</span> = <span class="org-string">"false"</span>;
  <span class="org-type">string</span> <span class="org-variable-name">s2</span> = <span class="org-string">"true"</span>;
  <span class="org-comment-delimiter">// </span><span class="org-comment">Konvertieren der Strings nach bool</span>
  <span class="org-type">bool</span> <span class="org-variable-name">b1</span> = string_to_bool(s1);
  <span class="org-type">bool</span> <span class="org-variable-name">b2</span> = string_to_bool(s2);

  cout &lt;&lt; <span class="org-string">"b1 = "</span> &lt;&lt; b1 &lt;&lt; endl;
  cout &lt;&lt; <span class="org-string">"b2 = "</span> &lt;&lt; b2 &lt;&lt; endl;
  <span class="org-comment-delimiter">// </span><span class="org-comment">Das ganze geht nat&#252;rlich auch ohne zus&#228;tzliche Variable</span>
  cout &lt;&lt; <span class="org-string">"false = "</span> &lt;&lt; string_to_bool(<span class="org-string">"false"</span>) &lt;&lt; endl;
  cout &lt;&lt; <span class="org-string">"true = "</span> &lt;&lt; string_to_bool(<span class="org-string">"true"</span>) &lt;&lt; endl;
}

<span class="org-comment-delimiter">// </span><span class="org-comment">Ausgabe:</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">b1 = 0</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">b2 = 1</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">false = 0</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">true = 1</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Ein-/Ausgabe</h2>
<div class="outline-text-2" id="text-5">
<p>
Um die folgende Funktionalität für die Ein- und Ausgabe verwenden zu
können muss die Headerdatei <code>iostream</code> mittels <code>#include &lt;iostream&gt;</code>
eingebunden werden.
</p>
</div>
