script/mci_cpp_script.tex
\subsubsection{Beispiel 2}
\label{sec-4-6-6}
Da wir Strings sehr einfach auf Gleichheit überprüfen können und auch
einfach als Parameter einer Funktion übernehmen können, ist es auch
sehr einfach die Strings \textasciitilde{}"true"\textasciitilde{} und \textasciitilde{}"false"\textasciitilde{} wieder in einen \verb~bool~
Wert zu konvertieren.
\begin{minted}[fontsize=\scriptsize,numberblanklines=false]{c++}
#include <iostream>
#include <string>
using namespace std; // Verhindert, dass wir überall std:: schreiben müssen

// Nimmt einen String entgegen ("true", "false") und liefert je nach
// übergebenem String die bool werte true oder false zurück
bool string_to_bool(string s) {
  if (s == "true")
    return true;
  else
    return false;
}

int main() {
  string s1 = "false";
  string s2 = "true";
  // Konvertieren der Strings nach bool
  bool b1 = string_to_bool(s1);
  bool b2 = string_to_bool(s2);

  cout << "b1 = " << b1 << endl;
  cout << "b2 = " << b2 << endl;
  // Das ganze geht natürlich auch ohne zusätzliche Variable
  cout << "false = " << string_to_bool("false") << endl;
  cout << "true = " << string_to_bool("true") << endl;
}

// Ausgabe:
// b1 = 0
// b2 = 1
// false = 0
// true = 1
\end{minted}

\section{Ein-/Ausgabe}
\label{sec-5}
Um die folgende Funktionalität für die Ein- und Ausgabe verwenden zu
können muss die Headerdatei \verb~iostream~ mittels \verb~#include <iostream>~
eingebunden werden.
