script/mci_cpp_script.org
** Ausgabe
Zur Ausgabe von Daten auf dem Bildschirm wird in C++ üblicherweise
~std::cout~ (für character out) verwendet. Variablen, Konstanten,
Ausdrücke, etc. werden mittels ~<<~ nach ~std::cout~ geschickt. Das
System erkennt automatisch den Typ der Daten die ausgegeben werden
sollen und verwendet die korrekte Formatierung (man kann sich also die
Formatplatzhalter von ~printf~ wie z.B. ~%d~, ~%f~, ~%s~, etc. sparen)

#+BEGIN_SRC C++
  #include <iostream>
  #include <string>

  int main() {
    // Variablen
    int i = 23;
    double d = 42.47;
    std::string s = "Hello World!";
    std::cout << i;
    std::cout << d;
    std::cout << s;
    // Konstanten
    std::cout << 45;
    std::cout << 34.5;
    std::cout << "Noch ein Hello!";
    // Ausdrücke
    std::cout << 2 * i;
    std::cout << (i * d) / 3.4;
    std::cout << s + " World2!";
  }
  // Ausgabe:
  // 2342.47Hello World!4534.5Noch ein Hello!46287.297Hello World! World2!
#+END_SRC

Die gleichzeitige Ausgabe mehrerer Daten kann durch wiederholtes
aneinanderhängen von ~<<~ erzielt werden. Will man z.B. die Variablen
~a~, ~b~ und ~c~ ausgeben, dann schreibt man ~std::cout << a << b <<
c;~.

#+BEGIN_SRC C++
  #include <iostream>
  #include <string>

  int main() {
    int i = 23;
    double d = 42.47;
    std::string s = "Hello World!";
    // Variablen
    std::cout << i << d << s;
    // Konstanten
    std::cout << 45 << 34.5 << "Noch ein Hello!";
    // Ausdrücke
    std::cout << 2 * i << (i * d) / 3.4 << s + " World2!";
  }
  // Ausgabe:
  // 2342.47Hello World!4534.5Noch ein Hello!46287.297Hello World! World2!
#+END_SRC 

Es werden bei Ausgabe mehrerer Daten in einer Zeile keine
automatischen Leerzeichen eingefügt. Falls man Leerzeichen hab will,
müssen diese manuell zwischen den Daten ausgegeben werden.

#+BEGIN_SRC C++
  #include <iostream>
  #include <string>

  int main() {
    int i = 23;
    double d = 42.47;
    std::string s = "Hello World!";
    // Variablen
    std::cout << i << " " << d << " " << s;
    // Konstanten
    std::cout << 45 << " " << 34.5 << " " << "Noch ein Hello!";
    // Ausdrücke
    std::cout << 2 * i << " " << (i * d) / 3.4 << " " << s + " World2!";
  }
  // Ausgabe:
  // 23 42.47 Hello World!45 34.5 Noch ein Hello!46 287.297 Hello World! World2!
#+END_SRC

An vorherigen Beispielen sieht man, dass ~cout~, genauso wie auch
~printf~, keinen automatischen Zeilenumbruch einfügt. Um einen
Zeilenumbruch zu erzwingen gibt man entweder ~std::endl~ (für endline)
oder wie in C ein ~\n~ aus.

#+BEGIN_SRC C++
  #include <iostream>
  #include <string>

  int main() {
    int i = 23;
    double d = 42.47;
    std::string s = "Hello World!";
    // Variablen
    std::cout << i << " " << d << " " << s << "\n";
    // Konstanten
    std::cout << 45 << " " << 34.5 << " " << "Noch ein Hello!" << std::endl;
    // Ausdrücke
    std::cout << 2 * i << " " << (i * d) / 3.4 << " " << s + " World2!\n";
  }
  // Ausgabe:
  // 23 42.47 Hello World!
  // 45 34.5 Noch ein Hello!
  // 46 287.297 Hello World! World2!
#+END_SRC
