script/mci_cpp_script.html
<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Ausgabe</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Zur Ausgabe von Daten auf dem Bildschirm wird in C++ üblicherweise
<code>std::cout</code> (für character out) verwendet. Variablen, Konstanten,
Ausdrücke, etc. werden mittels <code>&lt;&lt;</code> nach <code>std::cout</code> geschickt. Das
System erkennt automatisch den Typ der Daten die ausgegeben werden
sollen und verwendet die korrekte Formatierung (man kann sich also die
Formatplatzhalter von <code>printf</code> wie z.B. <code>%d</code>, <code>%f</code>, <code>%s</code>, etc. sparen)
</p>

<div class="org-src-container">

<pre class="src src-C++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;iostream&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;string&gt;</span>

<span class="org-type">int</span> <span class="org-function-name">main</span>() {
  <span class="org-comment-delimiter">// </span><span class="org-comment">Variablen</span>
  <span class="org-type">int</span> <span class="org-variable-name">i</span> = 23;
  <span class="org-type">double</span> <span class="org-variable-name">d</span> = 42.47;
  <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">s</span> = <span class="org-string">"Hello World!"</span>;
  <span class="org-constant">std</span>::cout &lt;&lt; i;
  <span class="org-constant">std</span>::cout &lt;&lt; d;
  <span class="org-constant">std</span>::cout &lt;&lt; s;
  <span class="org-comment-delimiter">// </span><span class="org-comment">Konstanten</span>
  <span class="org-constant">std</span>::cout &lt;&lt; 45;
  <span class="org-constant">std</span>::cout &lt;&lt; 34.5;
  <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Noch ein Hello!"</span>;
  <span class="org-comment-delimiter">// </span><span class="org-comment">Ausdr&#252;cke</span>
  <span class="org-constant">std</span>::cout &lt;&lt; 2 * i;
  <span class="org-constant">std</span>::cout &lt;&lt; (i * d) / 3.4;
  <span class="org-constant">std</span>::cout &lt;&lt; s + <span class="org-string">" World2!"</span>;
}
<span class="org-comment-delimiter">// </span><span class="org-comment">Ausgabe:</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">2342.47Hello World!4534.5Noch ein Hello!46287.297Hello World! World2!</span>
</pre>
</div>

<p>
Die gleichzeitige Ausgabe mehrerer Daten kann durch wiederholtes
aneinanderhängen von <code>&lt;&lt;</code> erzielt werden. Will man z.B. die Variablen
<code>a</code>, <code>b</code> und <code>c</code> ausgeben, dann schreibt man <code>std::cout &lt;&lt; a &lt;&lt; b &lt;&lt;
c;</code>.
</p>

<div class="org-src-container">

<pre class="src src-C++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;iostream&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;string&gt;</span>

<span class="org-type">int</span> <span class="org-function-name">main</span>() {
  <span class="org-type">int</span> <span class="org-variable-name">i</span> = 23;
  <span class="org-type">double</span> <span class="org-variable-name">d</span> = 42.47;
  <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">s</span> = <span class="org-string">"Hello World!"</span>;
  <span class="org-comment-delimiter">// </span><span class="org-comment">Variablen</span>
  <span class="org-constant">std</span>::cout &lt;&lt; i &lt;&lt; d &lt;&lt; s;
  <span class="org-comment-delimiter">// </span><span class="org-comment">Konstanten</span>
  <span class="org-constant">std</span>::cout &lt;&lt; 45 &lt;&lt; 34.5 &lt;&lt; <span class="org-string">"Noch ein Hello!"</span>;
  <span class="org-comment-delimiter">// </span><span class="org-comment">Ausdr&#252;cke</span>
  <span class="org-constant">std</span>::cout &lt;&lt; 2 * i &lt;&lt; (i * d) / 3.4 &lt;&lt; s + <span class="org-string">" World2!"</span>;
}
<span class="org-comment-delimiter">// </span><span class="org-comment">Ausgabe:</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">2342.47Hello World!4534.5Noch ein Hello!46287.297Hello World! World2!</span>
</pre>
</div>

<p>
Es werden bei Ausgabe mehrerer Daten in einer Zeile keine
automatischen Leerzeichen eingefügt. Falls man Leerzeichen hab will,
müssen diese manuell zwischen den Daten ausgegeben werden.
</p>

<div class="org-src-container">

<pre class="src src-C++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;iostream&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;string&gt;</span>

<span class="org-type">int</span> <span class="org-function-name">main</span>() {
  <span class="org-type">int</span> <span class="org-variable-name">i</span> = 23;
  <span class="org-type">double</span> <span class="org-variable-name">d</span> = 42.47;
  <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">s</span> = <span class="org-string">"Hello World!"</span>;
  <span class="org-comment-delimiter">// </span><span class="org-comment">Variablen</span>
  <span class="org-constant">std</span>::cout &lt;&lt; i &lt;&lt; <span class="org-string">" "</span> &lt;&lt; d &lt;&lt; <span class="org-string">" "</span> &lt;&lt; s;
  <span class="org-comment-delimiter">// </span><span class="org-comment">Konstanten</span>
  <span class="org-constant">std</span>::cout &lt;&lt; 45 &lt;&lt; <span class="org-string">" "</span> &lt;&lt; 34.5 &lt;&lt; <span class="org-string">" "</span> &lt;&lt; <span class="org-string">"Noch ein Hello!"</span>;
  <span class="org-comment-delimiter">// </span><span class="org-comment">Ausdr&#252;cke</span>
  <span class="org-constant">std</span>::cout &lt;&lt; 2 * i &lt;&lt; <span class="org-string">" "</span> &lt;&lt; (i * d) / 3.4 &lt;&lt; <span class="org-string">" "</span> &lt;&lt; s + <span class="org-string">" World2!"</span>;
}
<span class="org-comment-delimiter">// </span><span class="org-comment">Ausgabe:</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">23 42.47 Hello World!45 34.5 Noch ein Hello!46 287.297 Hello World! World2!</span>
</pre>
</div>

<p>
An vorherigen Beispielen sieht man, dass <code>cout</code>, genauso wie auch
<code>printf</code>, keinen automatischen Zeilenumbruch einfügt. Um einen
Zeilenumbruch zu erzwingen gibt man entweder <code>std::endl</code> (für endline)
oder wie in C ein <code>\n</code> aus.
</p>

<div class="org-src-container">

<pre class="src src-C++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;iostream&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;string&gt;</span>

<span class="org-type">int</span> <span class="org-function-name">main</span>() {
  <span class="org-type">int</span> <span class="org-variable-name">i</span> = 23;
  <span class="org-type">double</span> <span class="org-variable-name">d</span> = 42.47;
  <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">s</span> = <span class="org-string">"Hello World!"</span>;
  <span class="org-comment-delimiter">// </span><span class="org-comment">Variablen</span>
  <span class="org-constant">std</span>::cout &lt;&lt; i &lt;&lt; <span class="org-string">" "</span> &lt;&lt; d &lt;&lt; <span class="org-string">" "</span> &lt;&lt; s &lt;&lt; <span class="org-string">"\n"</span>;
  <span class="org-comment-delimiter">// </span><span class="org-comment">Konstanten</span>
  <span class="org-constant">std</span>::cout &lt;&lt; 45 &lt;&lt; <span class="org-string">" "</span> &lt;&lt; 34.5 &lt;&lt; <span class="org-string">" "</span> &lt;&lt; <span class="org-string">"Noch ein Hello!"</span> &lt;&lt; <span class="org-constant">std</span>::endl;
  <span class="org-comment-delimiter">// </span><span class="org-comment">Ausdr&#252;cke</span>
  <span class="org-constant">std</span>::cout &lt;&lt; 2 * i &lt;&lt; <span class="org-string">" "</span> &lt;&lt; (i * d) / 3.4 &lt;&lt; <span class="org-string">" "</span> &lt;&lt; s + <span class="org-string">" World2!\n"</span>;
}
<span class="org-comment-delimiter">// </span><span class="org-comment">Ausgabe:</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">23 42.47 Hello World!</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">45 34.5 Noch ein Hello!</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">46 287.297 Hello World! World2!</span>
</pre>
</div>
</div>
</div>
