script/mci_cpp_script.tex
\subsection{Ausgabe}
\label{sec-5-1}
Zur Ausgabe von Daten auf dem Bildschirm wird in C++ üblicherweise
\verb~std::cout~ (für character out) verwendet. Variablen, Konstanten,
Ausdrücke, etc. werden mittels \verb~<<~ nach \verb~std::cout~ geschickt. Das
System erkennt automatisch den Typ der Daten die ausgegeben werden
sollen und verwendet die korrekte Formatierung (man kann sich also die
Formatplatzhalter von \verb~printf~ wie z.B. \verb~%d~, \verb~%f~, \verb~%s~, etc. sparen)

\begin{minted}[fontsize=\scriptsize,numberblanklines=false]{c++}
#include <iostream>
#include <string>

int main() {
  // Variablen
  int i = 23;
  double d = 42.47;
  std::string s = "Hello World!";
  std::cout << i;
  std::cout << d;
  std::cout << s;
  // Konstanten
  std::cout << 45;
  std::cout << 34.5;
  std::cout << "Noch ein Hello!";
  // Ausdrücke
  std::cout << 2 * i;
  std::cout << (i * d) / 3.4;
  std::cout << s + " World2!";
}
// Ausgabe:
// 2342.47Hello World!4534.5Noch ein Hello!46287.297Hello World! World2!
\end{minted}

Die gleichzeitige Ausgabe mehrerer Daten kann durch wiederholtes
aneinanderhängen von \verb~<<~ erzielt werden. Will man z.B. die Variablen
\verb~a~, \verb~b~ und \verb~c~ ausgeben, dann schreibt man \verb~std::cout << a << b << c;~.

\begin{minted}[fontsize=\scriptsize,numberblanklines=false]{c++}
#include <iostream>
#include <string>

int main() {
  int i = 23;
  double d = 42.47;
  std::string s = "Hello World!";
  // Variablen
  std::cout << i << d << s;
  // Konstanten
  std::cout << 45 << 34.5 << "Noch ein Hello!";
  // Ausdrücke
  std::cout << 2 * i << (i * d) / 3.4 << s + " World2!";
}
// Ausgabe:
// 2342.47Hello World!4534.5Noch ein Hello!46287.297Hello World! World2!
\end{minted}

Es werden bei Ausgabe mehrerer Daten in einer Zeile keine
automatischen Leerzeichen eingefügt. Falls man Leerzeichen hab will,
müssen diese manuell zwischen den Daten ausgegeben werden.

\begin{minted}[fontsize=\scriptsize,numberblanklines=false]{c++}
#include <iostream>
#include <string>

int main() {
  int i = 23;
  double d = 42.47;
  std::string s = "Hello World!";
  // Variablen
  std::cout << i << " " << d << " " << s;
  // Konstanten
  std::cout << 45 << " " << 34.5 << " " << "Noch ein Hello!";
  // Ausdrücke
  std::cout << 2 * i << " " << (i * d) / 3.4 << " " << s + " World2!";
}
// Ausgabe:
// 23 42.47 Hello World!45 34.5 Noch ein Hello!46 287.297 Hello World! World2!
\end{minted}

An vorherigen Beispielen sieht man, dass \verb~cout~, genauso wie auch
\verb~printf~, keinen automatischen Zeilenumbruch einfügt. Um einen
Zeilenumbruch zu erzwingen gibt man entweder \verb~std::endl~ (für endline)
oder wie in C ein \verb~\n~ aus.

\begin{minted}[fontsize=\scriptsize,numberblanklines=false]{c++}
#include <iostream>
#include <string>

int main() {
  int i = 23;
  double d = 42.47;
  std::string s = "Hello World!";
  // Variablen
  std::cout << i << " " << d << " " << s << "\n";
  // Konstanten
  std::cout << 45 << " " << 34.5 << " " << "Noch ein Hello!" << std::endl;
  // Ausdrücke
  std::cout << 2 * i << " " << (i * d) / 3.4 << " " << s + " World2!\n";
}
// Ausgabe:
// 23 42.47 Hello World!
// 45 34.5 Noch ein Hello!
// 46 287.297 Hello World! World2!
\end{minted}
