script/mci_cpp_script.org
** Eingabe
Analog zur Ausgabe von Daten mittels ~std::cout~ werden mittels
~std::cin~ (character in) Daten vom Benutzer eingelesen. Um Daten
einlesen zu können muss bereits eine Variable deklariert sein in
welche die Daten geschrieben werden können. Das eigentliche Einlesen
geschieht mit dem Befehl ~std::cin >> variablenname;~. Beachten Sie,
dass die "Pfeile" von ~cin~ in die entgegengesetze Richtung weisen wie
bei ~cout~: ~std::cin >> bla;~ vs ~std::cout << bla;~.

Wir lesen z.B. einen Integer ein und geben ihn wieder aus:
#+BEGIN_SRC C++
  #include <iostream>

  int main() {
    // Ausgabe der Eingabeaufforderung
    std::cout << "Bitte geben Sie einen Integer ein: ";
    // Deklarieren der Variable in der die Eingabe gespeichert wird
    int i = 0;
    // Einlesen vom Benutzer in die Variable
    std::cin >> i;
    // Zu diesem Zeitpunkt ist die Variable i mit dem Wert befüllt, den
    // der Benutzer eingegeben hat und wir können den Inhalt ausgeben
    std::cout << "Sie haben die Zahl " << i << " eingegeben!\n";
  }
#+END_SRC
~cin~ liest immer bis zum nächsten Leerzeichen und man kann auch hier
mehrere Daten gleichzeitig einlesen indem mehrere Variablen mittels
~>>~ aneinanderhängt werden. 

Wir lesen z.B. drei ~double~ Werte ein und geben die Summe dieser aus:
#+BEGIN_SRC C++
  #include <iostream>

  int main() {
    double a = 0, b = 0, c = 0;
    std::cout << "Bitte geben Sie drei Zahlen ein: ";
    std::cin >> a >> b >> c;
    std::cout << "Die Summe der eingegebenen Zahlen = " << a + b + c << std::endl;
  }
#+END_SRC
Bei der Aufforderung ~Bitte geben Sie drei Zahlen ein:~ kann nun z.B.
~2.25 13.2 5.25~ eingegeben werden und die Variablen werden der Reihe
nach befüllt: ~a = 2.25~, ~b = 13.2~ und ~c = 5.25~.
*** getline
Wie erwähnt, liest ~cin~ jeweils bis zum nächsten Leerzeichen.
Insbesondere für das Einlesen eines Strings kann das unpraktisch sein,
weil man mit ~std::cin~ dadurch nur ein einziges Wort einlesen kann.
Um längere Texte einlesen zu können gibt es einen speziellen Befehl
namens ~std::getline~ welcher alles bis zum nächsten Zeilenumbruch
einliest und in einer Stringvariable abspeichert.
* COMMENT Namensräume
* COMMENT Kontrollstrukturen
** if
** switch/case
** while
** do-while
** for
** for-each
* COMMENT Funktionen
** Funktionsüberladung
* COMMENT Arrays und Container
** Fundamentale Arrays
** std::array
** vector
* COMMENT MCIGraph
* COMMENT Strukturen
* COMMENT Klassen
* COMMENT Vererbung
** Konstruktoren
** Kontrolle der Sichtbarkeit
* COMMENT Referenzen und Zeiger
** Zeiger
** Referenzen
* COMMENT Polymorphismus
** Copy Konstruktor
** Interfaces
** Abstrakte Klassen
* COMMENT Fehlerbehandlung in C++
* COMMENT Templates
* COMMENT Settings etc.
#+BEGIN_SRC elisp
  (setq org-export-babel-evaluate nil)
#+END_SRC
