script/mci_cpp_script.html
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Eingabe</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Analog zur Ausgabe von Daten mittels <code>std::cout</code> werden mittels
<code>std::cin</code> (character in) Daten vom Benutzer eingelesen. Um Daten
einlesen zu können muss bereits eine Variable deklariert sein in
welche die Daten geschrieben werden können. Das eigentliche Einlesen
geschieht mit dem Befehl <code>std::cin &gt;&gt; variablenname;</code>. Beachten Sie,
dass die "Pfeile" von <code>cin</code> in die entgegengesetze Richtung weisen wie
bei <code>cout</code>: <code>std::cin &gt;&gt; bla;</code> vs <code>std::cout &lt;&lt; bla;</code>.
</p>

<p>
Wir lesen z.B. einen Integer ein und geben ihn wieder aus:
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;iostream&gt;</span>

<span class="org-type">int</span> <span class="org-function-name">main</span>() {
  <span class="org-comment-delimiter">// </span><span class="org-comment">Ausgabe der Eingabeaufforderung</span>
  <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Bitte geben Sie einen Integer ein: "</span>;
  <span class="org-comment-delimiter">// </span><span class="org-comment">Deklarieren der Variable in der die Eingabe gespeichert wird</span>
  <span class="org-type">int</span> <span class="org-variable-name">i</span> = 0;
  <span class="org-comment-delimiter">// </span><span class="org-comment">Einlesen vom Benutzer in die Variable</span>
  <span class="org-constant">std</span>::cin &gt;&gt; i;
  <span class="org-comment-delimiter">// </span><span class="org-comment">Zu diesem Zeitpunkt ist die Variable i mit dem Wert bef&#252;llt, den</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">der Benutzer eingegeben hat und wir k&#246;nnen den Inhalt ausgeben</span>
  <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Sie haben die Zahl "</span> &lt;&lt; i &lt;&lt; <span class="org-string">" eingegeben!\n"</span>;
}
</pre>
</div>
<p>
<code>cin</code> liest immer bis zum nächsten Leerzeichen und man kann auch hier
mehrere Daten gleichzeitig einlesen indem mehrere Variablen mittels
<code>&gt;&gt;</code> aneinanderhängt werden. 
</p>

<p>
Wir lesen z.B. drei <code>double</code> Werte ein und geben die Summe dieser aus:
</p>
<div class="org-src-container">

<pre class="src src-C++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;iostream&gt;</span>

<span class="org-type">int</span> <span class="org-function-name">main</span>() {
  <span class="org-type">double</span> <span class="org-variable-name">a</span> = 0, <span class="org-variable-name">b</span> = 0, <span class="org-variable-name">c</span> = 0;
  <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Bitte geben Sie drei Zahlen ein: "</span>;
  <span class="org-constant">std</span>::cin &gt;&gt; a &gt;&gt; b &gt;&gt; c;
  <span class="org-constant">std</span>::cout &lt;&lt; <span class="org-string">"Die Summe der eingegebenen Zahlen = "</span> &lt;&lt; a + b + c &lt;&lt; <span class="org-constant">std</span>::endl;
}
</pre>
</div>
<p>
Bei der Aufforderung <code>Bitte geben Sie drei Zahlen ein:</code> kann nun z.B.
<code>2.25 13.2 5.25</code> eingegeben werden und die Variablen werden der Reihe
nach befüllt: <code>a = 2.25</code>, <code>b = 13.2</code> und <code>c = 5.25</code>.
</p>
</div>
<div id="outline-container-sec-5-2-1" class="outline-4">
<h4 id="sec-5-2-1"><span class="section-number-4">5.2.1</span> <code>getline</code></h4>
<div class="outline-text-4" id="text-5-2-1">
<p>
Wie erwähnt, liest <code>cin</code> jeweils bis zum nächsten Leerzeichen.
Insbesondere für das Einlesen eines Strings kann das unpraktisch sein,
weil man mit <code>std::cin</code> dadurch nur ein einziges Wort einlesen kann.
Um längere Texte einlesen zu können gibt es einen speziellen Befehl
namens <code>std::getline</code> welcher alles bis zum nächsten Zeilenumbruch
einliest und in einer Stringvariable abspeichert.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Sebastian Stabinger</p>
<p class="email">Email: <a href="mailto:sebastian@stabinger.name">sebastian@stabinger.name</a></p>
<p class="date">Created: 2018-03-21 Wed 00:05</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
