script/mci_cpp_script.tex
\subsection{Eingabe}
\label{sec-5-2}
Analog zur Ausgabe von Daten mittels \verb~std::cout~ werden mittels
\verb~std::cin~ (character in) Daten vom Benutzer eingelesen. Um Daten
einlesen zu können muss bereits eine Variable deklariert sein in
welche die Daten geschrieben werden können. Das eigentliche Einlesen
geschieht mit dem Befehl \verb~std::cin >> variablenname;~. Beachten Sie,
dass die "Pfeile" von \verb~cin~ in die entgegengesetze Richtung weisen wie
bei \verb~cout~: \verb~std::cin >> bla;~ vs \verb~std::cout << bla;~.

Wir lesen z.B. einen Integer ein und geben ihn wieder aus:
\begin{minted}[fontsize=\scriptsize,numberblanklines=false]{c++}
#include <iostream>

int main() {
  // Ausgabe der Eingabeaufforderung
  std::cout << "Bitte geben Sie einen Integer ein: ";
  // Deklarieren der Variable in der die Eingabe gespeichert wird
  int i = 0;
  // Einlesen vom Benutzer in die Variable
  std::cin >> i;
  // Zu diesem Zeitpunkt ist die Variable i mit dem Wert befüllt, den
  // der Benutzer eingegeben hat und wir können den Inhalt ausgeben
  std::cout << "Sie haben die Zahl " << i << " eingegeben!\n";
}
\end{minted}
\verb~cin~ liest immer bis zum nächsten Leerzeichen und man kann auch hier
mehrere Daten gleichzeitig einlesen indem mehrere Variablen mittels
\verb~>>~ aneinanderhängt werden. 

Wir lesen z.B. drei \verb~double~ Werte ein und geben die Summe dieser aus:
\begin{minted}[fontsize=\scriptsize,numberblanklines=false]{c++}
#include <iostream>

int main() {
  double a = 0, b = 0, c = 0;
  std::cout << "Bitte geben Sie drei Zahlen ein: ";
  std::cin >> a >> b >> c;
  std::cout << "Die Summe der eingegebenen Zahlen = " << a + b + c << std::endl;
}
\end{minted}
Bei der Aufforderung \verb~Bitte geben Sie drei Zahlen ein:~ kann nun z.B.
\verb~2.25 13.2 5.25~ eingegeben werden und die Variablen werden der Reihe
nach befüllt: \verb~a = 2.25~, \verb~b = 13.2~ und \verb~c = 5.25~.
\subsubsection{getline}
\label{sec-5-2-1}
Wie erwähnt, liest \verb~cin~ jeweils bis zum nächsten Leerzeichen.
Insbesondere für das Einlesen eines Strings kann das unpraktisch sein,
weil man mit \verb~std::cin~ dadurch nur ein einziges Wort einlesen kann.
Um längere Texte einlesen zu können gibt es einen speziellen Befehl
namens \verb~std::getline~ welcher alles bis zum nächsten Zeilenumbruch
einliest und in einer Stringvariable abspeichert.
% Emacs 25.3.1 (Org mode 8.2.10)
\end{document}